[{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Finally read it after months on KU Romances",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1EHKL0BNG56YR/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "9 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "So much hype over this book! I've read dozens and dozens of KU Romances across every genre - billionaire, mafia, same sex, enemies to lovers, second chance, dark, light, everything in between. There is some really good content over there so I finally wanted to see how they compared to one of the best selling romance novels of all time. Selfishly I also wanted to see how Hoover's writing (this is my first of hers i've read) compared to Sylvia Day whose Bared series I loved Books 1-3.Overall I give this a 4 stars. It didn't completely bowl me over but overall really good. One little admission is that I totally skipped the pages and pages and pages of \"journal entries\" aka back story for Lily and Atlas, and guess what? Still was able to figure out the story just fine :) It came across to me as filler and really slowed the plot down but I know some readers love those juicy details. I just wanted to get back to the main story line and honestly some of the entries were like 12 pages long. If you wanna do the same, I won't tell anybody and I promise you won't be lost.Spoilers ahead.This book honestly wasn't as dark as I thought it would be given all the talk of domestic violence. I thought it would be scene after scene, but there were only 3 incidents in the whole book, 2 of which were somewhat unintentional and/or partially happenstance, while the third was just nauseatingly purposeful. Some of the MC (Lily) reactions seemed a little fake or contrived, and especially I DID not like it when she informed Ryle WHILE HE HELD HIS NEWBORN BABY that she wanted a divorce. Surely she could have waited a day? I don't like when books make me dislike a protagonist and up until this very point at the end, I had really liked Lily.Ryle and his thought processes were right on. Having experience with men with major emotional trauma this really hit home for me and seemed incredibly realistic. There are two types of abusers in my opinion - the ones who are truly mean and don't care that they are hurting others and the the ones with the demons they can't control. Him putting on Lily by saying \"help me\" as though its up to her to heal him was really on point (if very, very wrong - he is responsible for his own healing).Anyway, overall pretty well done if a little too much filler in the middle of the book. The ending was pretty superb and that Epilogue! I have to admit I was rooting for Atlas the whole time, but I have a weak spot for rescuers. Unfortunately I didn't really get invested in any of the characters enough to want to spend the money or time on It Starts with Us, which starts where EWU leaves off. I think I'll move on to Ugly Love which I heard was steamier and is a little more along my preference lines.TBH if you are looking for pure drama and emotional angst Sylvia Day's Book 1 of Bared series is going to leave you gasping, its way more fast paced. Unfortunately though the series drops off in quality after book 3, and one thing CoHo fans love is her consistency.HTH!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 1
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1DC45AZ5WS3PZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "20 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2016",
  "reviewDescription": "*Review originally posted on Goodreads*'I wish cutting my feelings off for the person who hurt me was as easy as I used to think it would be. Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.'It Ends With Us was beautifully complicated. It was hot and cold. Up and down. Good and bad. Beautiful and ugly... I'm still trying to figure out how I really feel about it all because I'm genuinely torn on how I want to perceive this storyline. I loved it but in all honesty, I really do think I hate it as well. Not the \"I-hate-you-Colleen-Hoover-stop-writing-books-and-find-a-different-career\" type of hate but rather \"I-hate-you-Colleen-Hoover-for-making-me-hate-everything-that-I-came-to-love\" kind of hate because it pretty much summarizes all my thoughts and feelings about It Ends With Us in one sentence.My opinions were completely divided. One side of me, the hopeless romantic, was utterly unsatisfied and angry with the outcome of the story. The opposite side, the one that's all about women's empowerment, was cheering on #TeamLily like it was Independence Day.Rather than trying to sugarcoat my thoughts, I'm just going to be completely honest. I was 100 percent team Ryle from the very first time we met him. Just like Lily, I fell in love with every word and every gesture that rolled off of his body. I. WAS. HOOKED. It also didn't help that I kept fantasizing Doctor Mike as Ryle Kincaid. *heart eyes emoji* I loved his ambition. His personality. His confidence. To be honest, I think I might've loved Ryle even more than Lily did but that's another story for another day. That more than likely explains why I took the second half of this book like a blow to the gut.Once we got to the second half of the book, that's where it started going a bit downhill for me as a Ryle and Lily shipper. Every happy moment that ever happened between my ship came barreling down as it collided with pain and abuse. I was angry. I was thrashing. I was yelling at the pages in front of me, \"Why are you doing this Colleen?!\" But most importantly, I was just heartbroken to see such a beautiful couple become so toxic. Everything I loved about the first half of the book was slowly unraveling right before my very eyes as if it never really existed in the first place. I can't even remember how many times I wanted to put the book down because my hopeless romantic self just couldn't handle it anymore. But I just kept on reading because I was guiltily hoping that Ryle and Lily would still have their happy ending despite all that had happened. :/ Sadly, this was where I was torn the most.I have the upmost respect for Lily. She is definitely one of my favorite female characters that Colleen has ever created because she did what a lot of us would've struggled to do in the end: walk away. Lily was such a strong character and I admire her so much for having the strength to stand up for herself. There were numerous times towards the end of the book where I knew I probably would've gave in and forgave Ryle for his actions but Lily was inflexible. She was in a tough position but she put her foot down and demanded better for herself. In the end, no matter if I ship Ryle/Lily or Atlas/Lily, I'm glad that Lily was able to find peace for her and Emmy.As for Atlas, I liked him but I didn't love him. Definitely nowhere near my love for Ryle. I wasn't exactly rooting for Atlas but I wouldn't have minded if Lily chose him in the end. However, I still very much preferred Ryle regardless. I just felt that Atlas was the typical knight in shining armor. Typical good guy you run to. His background story was interesting but him as a character... not so much. He just felt so ordinary and predictable. I wanted to ship Atlas and Lily because let's face it, the signs were practically being shoved down our throats, and although the relationship between Ryle and Lily was developing, Atlas's presence was a like a thorn on your side you just couldn't shake off. But I just couldn't bring myself to ship them blindly like I did with Ryle and Lily.Unfortunately, I was too far gone and too far in love with the idea of Ryle and Lily to make room for Atlas and because of that, I'm not sure if I'll ever be fully satisfied with that ending. I was happy that Lily was no longer a victim of domestic abuse. I'm glad that after all that happened between them, Lily and Ryle parted on good terms. I'll forever be heartbroken over the idea of what could've been. And I feel indifferent to Lily and Atlas. Sorry not sorry, Atlas. That basically sums up all my feelings in a nutshell.To be honest, I was actually feeling a bit more bitter than I'm making it seem after that ending. But after reading the author's note, it really put things in perspective for me and made me look at the story with brand new eyes. I developed a new understanding and appreciation for the story behind the story.I was dying for Ryle and Lily to have their happy ending. Until the very end, I was still rooting for them. It's such an ugly confession to make especially when the couple you're rooting for is toxic and abusive. And I think I feel this way because I never, and hopefully I never will, had to experience abuse. I don't know what it's like and what goes on in the minds of the abused. Colleen did such an excellent job at creating the perfectly imperfect man that was Ryle. Abuse in books has always been a trigger for me and if it were any other book I think I would've put this book down by the first incident of abuse. But Colleen just made you fall so deeply in love with a character that even you couldn't bring yourself to hate him even if you wanted to. YOU were the Lily of this story. But unfortunately, I don't think my Lily would've had the courage to leave. I really wish I could say that I would leave in an instant, but I think I would honestly be lying to myself. You can tell yourself that if you were in Lily's position you would leave in a blink of an eye, but things wouldn't be as easily said and done if you were the one who was actually experiencing it all. And in truth, I think this is exactly what Colleen wanted us to actually sit down and think about because victims who've experienced abuse wouldn't be rooting for Ryle and Lily. I wouldn't be rooting for Ryle and Lily. It just goes to show how much of a struggle it really is to walk away from someone you love and loves you back in all the wrong ways. I usually never read the author's notes after the book but I'm really glad I took the time to read Colleen's story. It really did make me see the situation from a different perspective.I'd been having a bad CoHo streak for three books in a row (if you're curious, the books were — in order — Hopeless, November 9, and Too Late) and for a moment there I was beginning to think that I was doomed to never enjoy another book written by Colleen Hoover again. But PRAISE. It Ends With Us restored my faith completely in the CoHo hype. Not that I was ever planning NOT to read any more of Colleen's books! Colleen Hoover is 100 percent my favorite auto-buy author. I will always buy her books no matter if I end up loving them or not, and with good reason because Colleen is such an exceptional writer. It Ends With Us still wasn't able to top Ugly Love as my favorite CoHo book of all time but I really enjoyed this book more than I thought I would.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 2
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I COULD NOT PUT THIS BOOK DOWN.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1SYA6SUVHNITL/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "29 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 11, 2022",
  "reviewDescription": "This book.... OHHH my gosh. This book was so heart-wrenching, yet so beautiful at the same time. Coming from someone who has experienced domestic violence in the past it really hits home. When I first bought this book I didn't know what to except, but it wasn't this. It was everything I could've hoped for and MORE. I loved the way she portrayed Lily. She was so courageous, bold, relatable and perfect in all the right ways. I cannot wait for book 2!!! Once I finished, I couldn't stop crying for a whole hour straight. I can't even remember turning pages because it had me hooked that good!! READ IT READ IT READ IT!*SPOILERS*]First off, some of these reviews piss me off, especially the ones that are geared toward the main character Lily.\"Why did Colleen have her stay with someone who was constantly abusing her and treating her as so\"?\"I was so pissed she got right with Atlas right after the whole thing with Ryle happened, that would not happen in real life...\"First off, if you have ever experienced domestic violence in your life you would know how hard it is to leave the situation. Second, did you even read the book? Lily clearly states her confusion with either staying or leaving. It's not like she was staying with him because she liked the abuse?! Some of yawl's reviews seriously get to me. Imagine falling in love with someone who was absolutely perfect in your eyes and treated you in all the ways you'd ever imagine. You then get tied down... He starts to abuse you... Does things to you that you never thought this man who loved you SO much could possibly do?!? But it happens. It's not that easy to up in leave... If you TRULY knew what it is like to experience domestic abuse you would know that. So please stop getting mad at Lily for taking so long to leave! The whole thing about her getting with Atlas so fast after the whole dealio with Ryle ended, was PERFECT in my eyes. People are getting mad at how quickly she got back with him, but he was her safe place and FIRST true love (who matter-of-fact she never fell out of love with). I would've done the exact same dang thing!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 3
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Every woman should read this book",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1ASM5ROQC4Z16/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "32 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 17, 2022",
  "reviewDescription": "I have never been inspired to write a book review. This is my first. I read all the critical reviews, but the subject matter of this book hit a very sensitive nerve for me. First of all, for those who thought the book was too sensual or too emotional, I must venture a guess this subject matter is something they have never lived or even thought was possible.Domestic abuse has many sides and many questions. If you have not been a victim, it might be easy to say,”Why didn’t you leave?” This book answers many questions and explores the victims and abusers viewpoints. The most prominent quotation in this book for me is, “There are no bad people, only people who do bad things.” I believe the circumstances of our childhoods shape us into the adults we become, even more than genetics. The traumas we have to survive and the way we are made to feel about ourselves stay with us.I was a survivor of my parents abuse of each other. It was not just my father, but also my mother who fought violently with each other. I was able to go to university and leave the trauma physically, but not emotionally.I married the first man who proposed so I didn’t have to go home.I withstood his verbal and physical abuse for 28 years. He stopped hurting me before my bruises and choking so as not to send me to the hospital. I stayed with him for 28 years because he was a good father and my daughters loved him.I loved him because when he was good, he was very good. Was I stupid? Was I afraid to go out on my own? Yes. My children came first. I would endure anything for their safety and happiness.This amazing book addresses both sides of abuse, from each perspective. The heartbreak of having to decide your future with a man you love with all your heart, who loves you with everything he has in him, but who also has demons he is unable to control.Please read this book. It will give you sight into this ongoing tragedy between men and women. Withhold your judgment until the end, if you have the wisdom to do so",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 4
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "this book ripped me apart but made me yearn for love at the same time",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3VF1JYY5ESIQQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 26, 2022",
  "reviewDescription": "so this was my first book that ive read in probably 4 years. i only listen to harry potter at night to fall asleep lol so this was the first real adult book ive really ever read. at first i didnt like it because the first chapter seemed to drag on forever. i felt like i wasnt getting any insight into the characters and the whole plot was just kinda boring until about 1/4 of the way into the book. and then i was hooked. i finished this book in 3 days. i cried so many times because of how beautiful it was, especially lily's love with atlas. but i also cried because of how horrible it was, the abuse with ryle but also with lily's parents. it was just such a beautiful, sad book. i know a lot of people didnt like the journal entries where lily was writing about atlas but i LOVED THEM. the plotline with atlas was my favorite part of the book i LOVE him. his and lily's relationship was so sweet. i cant wait to read more about them in it starts with us. overall a very good read that will have you smiling and then sobbing within minutes. RECOMMEND!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 5
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "The Start to my Coho Obsession",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1BOSZ28SJ60U1/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "This book was something that I believe is the epitome of powerful woman doing what’s better for them and learning from others mistakes. Lily’s character was something I felt was someone I can relate to because I have seen how domestic violence can ruin a person and how hard it is to walk away from that person. It takes a lot of courage to do that, and the way this book’s plot developed was from a girl ready to accept the fate of the beaten house wife , but then she knew this isn’t what she was in Boston for . She wanted better than the future her mother already lived . In my heart of hearts , if you want a book that will keep you on the edge of your seat with the play on words but also can rip ur heart out and cry . then this is the book for you !!!!! plz read <3",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 6
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "If you don’t already have this… WHY NOT?!?!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2ML621WX04W8Z/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 25, 2022",
  "reviewDescription": "I am an avid ready. Lately I haven’t been reading as much as I once did due to working, raising kiddos, and taking care of the daily household things and when I did find the time to read, I usually entertained the education/self help books. I saw a co-worker reading this a few weeks ago at work and she couldn’t say enough positive things about it. I was a Twilight enthusiast back in middle school and have fond memories of reading that series and escaping from my real-life problems. I decided that life is too serious to use what little leisurely time I had available for reading on just education/self help and the take a dive back to the genre that captivated me back then. And Man. BEST. DECISION. Seriously, if you are on the fence for any reason, hope OFF and read this. Honestly, read all of Colleen Hoover’s books.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 7
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Wow",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RZ1QN1AXBDY2X/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "4 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2022",
  "reviewDescription": "I just want to start off by saying that I am 26 years old and I’ve never picked up a book in my life. I always swore I hated reading. After all my clients and co workers were telling me to read this book I said ok it’s worth a shot. Since the day I picked up this book I haven’t been able to put it down. I think about reading it all day at work. I read it on my lunch break and any chance that I get. Today I have finished the book and I decided to leave a review because I give credit when credit is due.. this book was AMAZING! I laughed I cried I felt every emotions I never knew a book could make me feel. In my 26 years I’ve finally read a whole book and I am so happy. I already pre ordered part 2 to this book and followed the author on IG lol. Thank you Colleen Hoover for being a bad ass author!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 8
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Not just another romance novel. This book will rip your heart out.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1Z8PBBD7G8UXI/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "6 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "She makes you fall in love with him, then rips your heart out and makes you wish it didn’t end that way. Amazing writing. I started out thinking it was just another romance novel, but I was COMPLETELY WRONG! This book makes you feel so many things, and makes you scream in your head at what you hope the outcome will be. I love that she helps show the women’s side of abuse to help people understand what goes through their mind and why they can’t just leave.My three favorite lines:“People spend so much time wondering why the women don’t leave. Where are all the people who wonder why the men are even abusive? Isn’t that where the only blame should be place?” 🙌 Yaaaas“Sometimes the things that matter to you most are also the things that hurt you the most. And in order to get over that hurt, you have to sever all the extensions that keep you tethered to that pain.”“We break the pattern before the pattern breaks us.”",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 9
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "especially wearing his adorable scrubs, is easy on the eyes and such ...",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2RVOWHQ5OY9CZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2016",
  "reviewDescription": "THE STORY:Lisa: I went into this story completely blind. I do this quite a bit, honestly, and it almost always pays off. But with this book especially, I think going in blind is the way to go. If that’s not your reading style, I’ll give you just a bit of background.Lily hasn’t lived the easiest life. After graduating from college she moved to Boston where she opened her own business. Things were finally looking up for her. All of her hard work had paid off. She runs into a local neurosurgeon and immediately feels a connection with him. Ryle, especially wearing his adorable scrubs, is easy on the eyes and such a charmer. He’s also a player and only wants one-night-stands. He refuses to get into a relationship for several reasons, one of them being he just doesn’t have the time outside of being a doctor to be in a real relationship. The sparks start flying and Lily realizes she’s quite interested in Ryle… that is, until a blast from her past, Atlas, reappears, and brings up allllll kinds of confusing feelings.Becca: Yes! I 100% agree with Lisa, if you can go into this one blind then I recommend that you do! It was absolutely incredible to experience each moment and have no idea what was going to happen next!I don’t want to say too much and spoil the story for anyone. I will say that this book does span a large part of Lily’s life. We see her as a teen and also as an adult, it was very well done and I enjoyed the blend of past and present.THE CHARACTERS:Becca: Oh these characters… where do I begin?! I absolutely loved Lily! She had been through so much in her life, yet she persevered and followed her dreams. She was strong and fought for what she believed in. I loved learning about her past and being with her in the present. I felt as though I knew her, I understood and empathized with very thought and every emotion.When Lily met Ryle, I fell for him as instantaneously as she did. He was strong, confident, funny and of course sexy in scrubs ;) Their relationship was a whirlwind that wrapped them up so quickly and I was in it with them! When things got tough for them, I felt every moment as harshly as they did.When Atlas (the blast from Lily’s past) appears it throws this whole story in a different direction. Of course, we meet him with young Lily and then again later in the book. Atlas has this smooth, quiet confidence about him. He comes from absolutely nothing and makes something out of himself. I admired and respected him and I fell for him big time!I know some of you are probably sniffing out a love triangle and freaking out. In my opinion, that is NOT what this is. Some may call it a love triangle on a technical basis, but it really is not and I urge you not to skip this one for that reason because that term is to cliched for what this book actually is.Also the secondary characters in this book, Lily’s parents and Ryle’s sister and her husband are truly imperative in this story. They are just perfect and add so much to the story.I do not think that there is another Author out there who can make me fall in love with characters quite so hard. CoHo develops her characters so well that I feel as though I know them! I had so many feels for these characters that my heart couldn’t handle it! In the past I have loved many CoHo characters (and I still do) but none made me feel what these characters did and none made me feel quite so much that I was a part of their story. Trust me when I say these are characters that you want to meet.Lisa: That’s so, so true, Becca! I agree that CoHo has an amazing ability to make us fall in love with ALL characters, even the not-so-easy-to-love ones.I’m honestly not sure I would categorize this as a love triangle. I know others have, but I disagree. (view spoiler)My favorite characters in this story were, as Becca mentioned, the secondary characters. Specifically Ryle’s sister and her husband, who are wonderful additions to this beautiful story. I also enjoyed the family dynamics and how everyone had each others’ backs when it was most important.TO SUM UP:Lisa: WOW! Just… wow! This has got to be the BEST book Colleen Hoover has written to date. The stark honesty and impacting nature of this story will punch you in the feels. Hard. I’ve never experienced an abuse story to quite this level. I was blown away by this story and left a babbling ball of nerves and tears. A book hasn’t touched me this deeply in quite some time. I also learned quite a bit from this story. We’re always so quick to judge in instances of abuse… but there’s so much more to the story than you see with the naked eye. Don’t judge. Don’t assume facts that aren’t true. And, most importantly, don’t ever think it can’t happen to you or someone you know. Such a strong story that is sure to impact every reader that opens the cover in one way or another. I’m leave completely blown away by this story, as well as hopeful, which is such a wonderful thing. Colleen, you’ve done it AGAIN!Becca: I know some of you may think that I always say this and yes I am a true CoHo fan, but this is by far her best work ever. It Ends With Us is so raw and full of emotions, but most of all it is honest. I cried… A LOT! And I am not talking a few tears or a quiet wimper… I am talking ugly crying that I couldn’t contain. The message it delivers is a powerful one and I know that this is a book that will stay with me forever. Please make sure that once you are done you read the Author note at the end, it will give you an even better view of this book afterward.Colleen Hoover, you slay me with your words. You break my heart and then put the pieces back together. You are an amazing writer and I believe you are a gift for readers like myself. Keep doing what you are doing and I will keep reading everything that you write.(Thanks to Atria Books for the review copy!)",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 10
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "read past the first couple of pages!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2MQZSDO2BPSMO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 25, 2022",
  "reviewDescription": "i’ve read this book 3 times! the first time it took me less than a day. i really wanted to stop after the first page cause i thought i was gonna hate it. i was so so wrong!! it’s literally the best book ever! it got me back into reading after several years! 10/10 recommend!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 61
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "This book is life changing.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RXYK7R0VQW8AQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 19, 2022",
  "reviewDescription": "This is definitely one of the best books I’ve ever had the pleasure of owning. Thank you so much for delivering such an amazing story so full of so many emotions. Nothing has ever made me feel so many things at once as this book was able achieve. Thank you so much for this story.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 62
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I finished this book in two days",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R16Y86G6RDIT9Q/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "This is the kind of work I want to read, this makes reading worth it, this is the kind of art we should all aspire to create, this is REAL.I recommend this to everyone and anyone. I will be mailing copies to all of my friends and my dear mother.-Jazmin Garcia-Larracuente",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 63
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "It was Amaaaazing!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2M3RWDN0XP7IB/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 4, 2022",
  "reviewDescription": "So a friend of mine has been telling me about the writing of Colleen Hoover. It Ends With Us was chosen as my book club book for the month of August. Yall! When I say \"I ate this book up\".  It had everything that I wanted in a book.... laughter, drama... some parts made me hot and bothered... and I had a good cry on other parts... and I got the warm fuzzy feels too! I can't wait to read the sequel. This book can be read as a stand alone book but I'm glad she's coming out with a sequel. I want more!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 64
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "page turner",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1SFMCE2YX6GXM/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 27, 2022",
  "reviewDescription": "I am not a reader but I was hoping to replace going on social media with a good book. I heard about this one on tik tok and thought this would be the perfect one. I loved every second of this book and I can not wait to read more of Colleen Hoovers books.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 65
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Touchs on every emotion",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1NUW7N4KB2LB9/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "This book was great. I experienced every emotion, laugher, boredom, happiness and anger. A couple parts I got so angry I shut the book and said I was done(but I wasn't)My only complaint is it took 2 days start-finish and pages started falling out so that made me angryOverall great book",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 66
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "COULD NOT PUT IT DOWN!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2WCYC06CB3J6B/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "I finally decided to jump on the Colleen Hoover train & started with this book. Let me just say that I am not disappointed. This story is so well written, emotional, heartbreaking, touching and so many other words. Great job Colleen Hoover!! I can’t wait to read more of your books!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 67
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Great book !!!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R38GAS76FAMA2H/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 26, 2022",
  "reviewDescription": "Im not a person who likes to read, but once I heard about this book I was like okay let me get it start something new after getting out a toxic relationship! And now this was the best idea ever I can’t put this book down lol I’m obsessed!!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 68
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "amazing",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3NFQF80FAG20J/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 27, 2022",
  "reviewDescription": "i hate reading but in the first time in years i decided to read and this was the book absolutely amazing beautifully detailed just amazing in every way if you love romance with some drama and sadly family drama this is the book for you can’t wait for it starts with us to come out",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 69
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "MUST READ",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2V1ONKMBMJD9E/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 14, 2022",
  "reviewDescription": "When I say I could not put the book down I mean I could not put it down. When I saw all the hype over this book I didn’t really think it would be that good, wow was I wrong. Colleen Hoover did something with this book. The second one comes out October 18,2022 so if you were debating reading this do it before the next ones comes out. I never write detailed reviews but this one deserved it.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 70
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Finally read it after months on KU Romances",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1EHKL0BNG56YR/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "9 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "So much hype over this book! I've read dozens and dozens of KU Romances across every genre - billionaire, mafia, same sex, enemies to lovers, second chance, dark, light, everything in between. There is some really good content over there so I finally wanted to see how they compared to one of the best selling romance novels of all time. Selfishly I also wanted to see how Hoover's writing (this is my first of hers i've read) compared to Sylvia Day whose Bared series I loved Books 1-3.Overall I give this a 4 stars. It didn't completely bowl me over but overall really good. One little admission is that I totally skipped the pages and pages and pages of \"journal entries\" aka back story for Lily and Atlas, and guess what? Still was able to figure out the story just fine :) It came across to me as filler and really slowed the plot down but I know some readers love those juicy details. I just wanted to get back to the main story line and honestly some of the entries were like 12 pages long. If you wanna do the same, I won't tell anybody and I promise you won't be lost.Spoilers ahead.This book honestly wasn't as dark as I thought it would be given all the talk of domestic violence. I thought it would be scene after scene, but there were only 3 incidents in the whole book, 2 of which were somewhat unintentional and/or partially happenstance, while the third was just nauseatingly purposeful. Some of the MC (Lily) reactions seemed a little fake or contrived, and especially I DID not like it when she informed Ryle WHILE HE HELD HIS NEWBORN BABY that she wanted a divorce. Surely she could have waited a day? I don't like when books make me dislike a protagonist and up until this very point at the end, I had really liked Lily.Ryle and his thought processes were right on. Having experience with men with major emotional trauma this really hit home for me and seemed incredibly realistic. There are two types of abusers in my opinion - the ones who are truly mean and don't care that they are hurting others and the the ones with the demons they can't control. Him putting on Lily by saying \"help me\" as though its up to her to heal him was really on point (if very, very wrong - he is responsible for his own healing).Anyway, overall pretty well done if a little too much filler in the middle of the book. The ending was pretty superb and that Epilogue! I have to admit I was rooting for Atlas the whole time, but I have a weak spot for rescuers. Unfortunately I didn't really get invested in any of the characters enough to want to spend the money or time on It Starts with Us, which starts where EWU leaves off. I think I'll move on to Ugly Love which I heard was steamier and is a little more along my preference lines.TBH if you are looking for pure drama and emotional angst Sylvia Day's Book 1 of Bared series is going to leave you gasping, its way more fast paced. Unfortunately though the series drops off in quality after book 3, and one thing CoHo fans love is her consistency.HTH!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 91
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1DC45AZ5WS3PZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "20 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2016",
  "reviewDescription": "*Review originally posted on Goodreads*'I wish cutting my feelings off for the person who hurt me was as easy as I used to think it would be. Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.'It Ends With Us was beautifully complicated. It was hot and cold. Up and down. Good and bad. Beautiful and ugly... I'm still trying to figure out how I really feel about it all because I'm genuinely torn on how I want to perceive this storyline. I loved it but in all honesty, I really do think I hate it as well. Not the \"I-hate-you-Colleen-Hoover-stop-writing-books-and-find-a-different-career\" type of hate but rather \"I-hate-you-Colleen-Hoover-for-making-me-hate-everything-that-I-came-to-love\" kind of hate because it pretty much summarizes all my thoughts and feelings about It Ends With Us in one sentence.My opinions were completely divided. One side of me, the hopeless romantic, was utterly unsatisfied and angry with the outcome of the story. The opposite side, the one that's all about women's empowerment, was cheering on #TeamLily like it was Independence Day.Rather than trying to sugarcoat my thoughts, I'm just going to be completely honest. I was 100 percent team Ryle from the very first time we met him. Just like Lily, I fell in love with every word and every gesture that rolled off of his body. I. WAS. HOOKED. It also didn't help that I kept fantasizing Doctor Mike as Ryle Kincaid. *heart eyes emoji* I loved his ambition. His personality. His confidence. To be honest, I think I might've loved Ryle even more than Lily did but that's another story for another day. That more than likely explains why I took the second half of this book like a blow to the gut.Once we got to the second half of the book, that's where it started going a bit downhill for me as a Ryle and Lily shipper. Every happy moment that ever happened between my ship came barreling down as it collided with pain and abuse. I was angry. I was thrashing. I was yelling at the pages in front of me, \"Why are you doing this Colleen?!\" But most importantly, I was just heartbroken to see such a beautiful couple become so toxic. Everything I loved about the first half of the book was slowly unraveling right before my very eyes as if it never really existed in the first place. I can't even remember how many times I wanted to put the book down because my hopeless romantic self just couldn't handle it anymore. But I just kept on reading because I was guiltily hoping that Ryle and Lily would still have their happy ending despite all that had happened. :/ Sadly, this was where I was torn the most.I have the upmost respect for Lily. She is definitely one of my favorite female characters that Colleen has ever created because she did what a lot of us would've struggled to do in the end: walk away. Lily was such a strong character and I admire her so much for having the strength to stand up for herself. There were numerous times towards the end of the book where I knew I probably would've gave in and forgave Ryle for his actions but Lily was inflexible. She was in a tough position but she put her foot down and demanded better for herself. In the end, no matter if I ship Ryle/Lily or Atlas/Lily, I'm glad that Lily was able to find peace for her and Emmy.As for Atlas, I liked him but I didn't love him. Definitely nowhere near my love for Ryle. I wasn't exactly rooting for Atlas but I wouldn't have minded if Lily chose him in the end. However, I still very much preferred Ryle regardless. I just felt that Atlas was the typical knight in shining armor. Typical good guy you run to. His background story was interesting but him as a character... not so much. He just felt so ordinary and predictable. I wanted to ship Atlas and Lily because let's face it, the signs were practically being shoved down our throats, and although the relationship between Ryle and Lily was developing, Atlas's presence was a like a thorn on your side you just couldn't shake off. But I just couldn't bring myself to ship them blindly like I did with Ryle and Lily.Unfortunately, I was too far gone and too far in love with the idea of Ryle and Lily to make room for Atlas and because of that, I'm not sure if I'll ever be fully satisfied with that ending. I was happy that Lily was no longer a victim of domestic abuse. I'm glad that after all that happened between them, Lily and Ryle parted on good terms. I'll forever be heartbroken over the idea of what could've been. And I feel indifferent to Lily and Atlas. Sorry not sorry, Atlas. That basically sums up all my feelings in a nutshell.To be honest, I was actually feeling a bit more bitter than I'm making it seem after that ending. But after reading the author's note, it really put things in perspective for me and made me look at the story with brand new eyes. I developed a new understanding and appreciation for the story behind the story.I was dying for Ryle and Lily to have their happy ending. Until the very end, I was still rooting for them. It's such an ugly confession to make especially when the couple you're rooting for is toxic and abusive. And I think I feel this way because I never, and hopefully I never will, had to experience abuse. I don't know what it's like and what goes on in the minds of the abused. Colleen did such an excellent job at creating the perfectly imperfect man that was Ryle. Abuse in books has always been a trigger for me and if it were any other book I think I would've put this book down by the first incident of abuse. But Colleen just made you fall so deeply in love with a character that even you couldn't bring yourself to hate him even if you wanted to. YOU were the Lily of this story. But unfortunately, I don't think my Lily would've had the courage to leave. I really wish I could say that I would leave in an instant, but I think I would honestly be lying to myself. You can tell yourself that if you were in Lily's position you would leave in a blink of an eye, but things wouldn't be as easily said and done if you were the one who was actually experiencing it all. And in truth, I think this is exactly what Colleen wanted us to actually sit down and think about because victims who've experienced abuse wouldn't be rooting for Ryle and Lily. I wouldn't be rooting for Ryle and Lily. It just goes to show how much of a struggle it really is to walk away from someone you love and loves you back in all the wrong ways. I usually never read the author's notes after the book but I'm really glad I took the time to read Colleen's story. It really did make me see the situation from a different perspective.I'd been having a bad CoHo streak for three books in a row (if you're curious, the books were — in order — Hopeless, November 9, and Too Late) and for a moment there I was beginning to think that I was doomed to never enjoy another book written by Colleen Hoover again. But PRAISE. It Ends With Us restored my faith completely in the CoHo hype. Not that I was ever planning NOT to read any more of Colleen's books! Colleen Hoover is 100 percent my favorite auto-buy author. I will always buy her books no matter if I end up loving them or not, and with good reason because Colleen is such an exceptional writer. It Ends With Us still wasn't able to top Ugly Love as my favorite CoHo book of all time but I really enjoyed this book more than I thought I would.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 92
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I COULD NOT PUT THIS BOOK DOWN.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1SYA6SUVHNITL/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "29 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 11, 2022",
  "reviewDescription": "This book.... OHHH my gosh. This book was so heart-wrenching, yet so beautiful at the same time. Coming from someone who has experienced domestic violence in the past it really hits home. When I first bought this book I didn't know what to except, but it wasn't this. It was everything I could've hoped for and MORE. I loved the way she portrayed Lily. She was so courageous, bold, relatable and perfect in all the right ways. I cannot wait for book 2!!! Once I finished, I couldn't stop crying for a whole hour straight. I can't even remember turning pages because it had me hooked that good!! READ IT READ IT READ IT!*SPOILERS*]First off, some of these reviews piss me off, especially the ones that are geared toward the main character Lily.\"Why did Colleen have her stay with someone who was constantly abusing her and treating her as so\"?\"I was so pissed she got right with Atlas right after the whole thing with Ryle happened, that would not happen in real life...\"First off, if you have ever experienced domestic violence in your life you would know how hard it is to leave the situation. Second, did you even read the book? Lily clearly states her confusion with either staying or leaving. It's not like she was staying with him because she liked the abuse?! Some of yawl's reviews seriously get to me. Imagine falling in love with someone who was absolutely perfect in your eyes and treated you in all the ways you'd ever imagine. You then get tied down... He starts to abuse you... Does things to you that you never thought this man who loved you SO much could possibly do?!? But it happens. It's not that easy to up in leave... If you TRULY knew what it is like to experience domestic abuse you would know that. So please stop getting mad at Lily for taking so long to leave! The whole thing about her getting with Atlas so fast after the whole dealio with Ryle ended, was PERFECT in my eyes. People are getting mad at how quickly she got back with him, but he was her safe place and FIRST true love (who matter-of-fact she never fell out of love with). I would've done the exact same dang thing!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 93
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Every woman should read this book",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1ASM5ROQC4Z16/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "32 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 17, 2022",
  "reviewDescription": "I have never been inspired to write a book review. This is my first. I read all the critical reviews, but the subject matter of this book hit a very sensitive nerve for me. First of all, for those who thought the book was too sensual or too emotional, I must venture a guess this subject matter is something they have never lived or even thought was possible.Domestic abuse has many sides and many questions. If you have not been a victim, it might be easy to say,”Why didn’t you leave?” This book answers many questions and explores the victims and abusers viewpoints. The most prominent quotation in this book for me is, “There are no bad people, only people who do bad things.” I believe the circumstances of our childhoods shape us into the adults we become, even more than genetics. The traumas we have to survive and the way we are made to feel about ourselves stay with us.I was a survivor of my parents abuse of each other. It was not just my father, but also my mother who fought violently with each other. I was able to go to university and leave the trauma physically, but not emotionally.I married the first man who proposed so I didn’t have to go home.I withstood his verbal and physical abuse for 28 years. He stopped hurting me before my bruises and choking so as not to send me to the hospital. I stayed with him for 28 years because he was a good father and my daughters loved him.I loved him because when he was good, he was very good. Was I stupid? Was I afraid to go out on my own? Yes. My children came first. I would endure anything for their safety and happiness.This amazing book addresses both sides of abuse, from each perspective. The heartbreak of having to decide your future with a man you love with all your heart, who loves you with everything he has in him, but who also has demons he is unable to control.Please read this book. It will give you sight into this ongoing tragedy between men and women. Withhold your judgment until the end, if you have the wisdom to do so",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 94
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "this book ripped me apart but made me yearn for love at the same time",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3VF1JYY5ESIQQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 26, 2022",
  "reviewDescription": "so this was my first book that ive read in probably 4 years. i only listen to harry potter at night to fall asleep lol so this was the first real adult book ive really ever read. at first i didnt like it because the first chapter seemed to drag on forever. i felt like i wasnt getting any insight into the characters and the whole plot was just kinda boring until about 1/4 of the way into the book. and then i was hooked. i finished this book in 3 days. i cried so many times because of how beautiful it was, especially lily's love with atlas. but i also cried because of how horrible it was, the abuse with ryle but also with lily's parents. it was just such a beautiful, sad book. i know a lot of people didnt like the journal entries where lily was writing about atlas but i LOVED THEM. the plotline with atlas was my favorite part of the book i LOVE him. his and lily's relationship was so sweet. i cant wait to read more about them in it starts with us. overall a very good read that will have you smiling and then sobbing within minutes. RECOMMEND!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 95
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "The Start to my Coho Obsession",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1BOSZ28SJ60U1/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "This book was something that I believe is the epitome of powerful woman doing what’s better for them and learning from others mistakes. Lily’s character was something I felt was someone I can relate to because I have seen how domestic violence can ruin a person and how hard it is to walk away from that person. It takes a lot of courage to do that, and the way this book’s plot developed was from a girl ready to accept the fate of the beaten house wife , but then she knew this isn’t what she was in Boston for . She wanted better than the future her mother already lived . In my heart of hearts , if you want a book that will keep you on the edge of your seat with the play on words but also can rip ur heart out and cry . then this is the book for you !!!!! plz read <3",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 96
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "If you don’t already have this… WHY NOT?!?!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2ML621WX04W8Z/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 25, 2022",
  "reviewDescription": "I am an avid ready. Lately I haven’t been reading as much as I once did due to working, raising kiddos, and taking care of the daily household things and when I did find the time to read, I usually entertained the education/self help books. I saw a co-worker reading this a few weeks ago at work and she couldn’t say enough positive things about it. I was a Twilight enthusiast back in middle school and have fond memories of reading that series and escaping from my real-life problems. I decided that life is too serious to use what little leisurely time I had available for reading on just education/self help and the take a dive back to the genre that captivated me back then. And Man. BEST. DECISION. Seriously, if you are on the fence for any reason, hope OFF and read this. Honestly, read all of Colleen Hoover’s books.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 97
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Wow",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RZ1QN1AXBDY2X/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "4 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2022",
  "reviewDescription": "I just want to start off by saying that I am 26 years old and I’ve never picked up a book in my life. I always swore I hated reading. After all my clients and co workers were telling me to read this book I said ok it’s worth a shot. Since the day I picked up this book I haven’t been able to put it down. I think about reading it all day at work. I read it on my lunch break and any chance that I get. Today I have finished the book and I decided to leave a review because I give credit when credit is due.. this book was AMAZING! I laughed I cried I felt every emotions I never knew a book could make me feel. In my 26 years I’ve finally read a whole book and I am so happy. I already pre ordered part 2 to this book and followed the author on IG lol. Thank you Colleen Hoover for being a bad ass author!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 98
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Not just another romance novel. This book will rip your heart out.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1Z8PBBD7G8UXI/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "6 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "She makes you fall in love with him, then rips your heart out and makes you wish it didn’t end that way. Amazing writing. I started out thinking it was just another romance novel, but I was COMPLETELY WRONG! This book makes you feel so many things, and makes you scream in your head at what you hope the outcome will be. I love that she helps show the women’s side of abuse to help people understand what goes through their mind and why they can’t just leave.My three favorite lines:“People spend so much time wondering why the women don’t leave. Where are all the people who wonder why the men are even abusive? Isn’t that where the only blame should be place?” 🙌 Yaaaas“Sometimes the things that matter to you most are also the things that hurt you the most. And in order to get over that hurt, you have to sever all the extensions that keep you tethered to that pain.”“We break the pattern before the pattern breaks us.”",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 99
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "especially wearing his adorable scrubs, is easy on the eyes and such ...",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2RVOWHQ5OY9CZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2016",
  "reviewDescription": "THE STORY:Lisa: I went into this story completely blind. I do this quite a bit, honestly, and it almost always pays off. But with this book especially, I think going in blind is the way to go. If that’s not your reading style, I’ll give you just a bit of background.Lily hasn’t lived the easiest life. After graduating from college she moved to Boston where she opened her own business. Things were finally looking up for her. All of her hard work had paid off. She runs into a local neurosurgeon and immediately feels a connection with him. Ryle, especially wearing his adorable scrubs, is easy on the eyes and such a charmer. He’s also a player and only wants one-night-stands. He refuses to get into a relationship for several reasons, one of them being he just doesn’t have the time outside of being a doctor to be in a real relationship. The sparks start flying and Lily realizes she’s quite interested in Ryle… that is, until a blast from her past, Atlas, reappears, and brings up allllll kinds of confusing feelings.Becca: Yes! I 100% agree with Lisa, if you can go into this one blind then I recommend that you do! It was absolutely incredible to experience each moment and have no idea what was going to happen next!I don’t want to say too much and spoil the story for anyone. I will say that this book does span a large part of Lily’s life. We see her as a teen and also as an adult, it was very well done and I enjoyed the blend of past and present.THE CHARACTERS:Becca: Oh these characters… where do I begin?! I absolutely loved Lily! She had been through so much in her life, yet she persevered and followed her dreams. She was strong and fought for what she believed in. I loved learning about her past and being with her in the present. I felt as though I knew her, I understood and empathized with very thought and every emotion.When Lily met Ryle, I fell for him as instantaneously as she did. He was strong, confident, funny and of course sexy in scrubs ;) Their relationship was a whirlwind that wrapped them up so quickly and I was in it with them! When things got tough for them, I felt every moment as harshly as they did.When Atlas (the blast from Lily’s past) appears it throws this whole story in a different direction. Of course, we meet him with young Lily and then again later in the book. Atlas has this smooth, quiet confidence about him. He comes from absolutely nothing and makes something out of himself. I admired and respected him and I fell for him big time!I know some of you are probably sniffing out a love triangle and freaking out. In my opinion, that is NOT what this is. Some may call it a love triangle on a technical basis, but it really is not and I urge you not to skip this one for that reason because that term is to cliched for what this book actually is.Also the secondary characters in this book, Lily’s parents and Ryle’s sister and her husband are truly imperative in this story. They are just perfect and add so much to the story.I do not think that there is another Author out there who can make me fall in love with characters quite so hard. CoHo develops her characters so well that I feel as though I know them! I had so many feels for these characters that my heart couldn’t handle it! In the past I have loved many CoHo characters (and I still do) but none made me feel what these characters did and none made me feel quite so much that I was a part of their story. Trust me when I say these are characters that you want to meet.Lisa: That’s so, so true, Becca! I agree that CoHo has an amazing ability to make us fall in love with ALL characters, even the not-so-easy-to-love ones.I’m honestly not sure I would categorize this as a love triangle. I know others have, but I disagree. (view spoiler)My favorite characters in this story were, as Becca mentioned, the secondary characters. Specifically Ryle’s sister and her husband, who are wonderful additions to this beautiful story. I also enjoyed the family dynamics and how everyone had each others’ backs when it was most important.TO SUM UP:Lisa: WOW! Just… wow! This has got to be the BEST book Colleen Hoover has written to date. The stark honesty and impacting nature of this story will punch you in the feels. Hard. I’ve never experienced an abuse story to quite this level. I was blown away by this story and left a babbling ball of nerves and tears. A book hasn’t touched me this deeply in quite some time. I also learned quite a bit from this story. We’re always so quick to judge in instances of abuse… but there’s so much more to the story than you see with the naked eye. Don’t judge. Don’t assume facts that aren’t true. And, most importantly, don’t ever think it can’t happen to you or someone you know. Such a strong story that is sure to impact every reader that opens the cover in one way or another. I’m leave completely blown away by this story, as well as hopeful, which is such a wonderful thing. Colleen, you’ve done it AGAIN!Becca: I know some of you may think that I always say this and yes I am a true CoHo fan, but this is by far her best work ever. It Ends With Us is so raw and full of emotions, but most of all it is honest. I cried… A LOT! And I am not talking a few tears or a quiet wimper… I am talking ugly crying that I couldn’t contain. The message it delivers is a powerful one and I know that this is a book that will stay with me forever. Please make sure that once you are done you read the Author note at the end, it will give you an even better view of this book afterward.Colleen Hoover, you slay me with your words. You break my heart and then put the pieces back together. You are an amazing writer and I believe you are a gift for readers like myself. Keep doing what you are doing and I will keep reading everything that you write.(Thanks to Atria Books for the review copy!)",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T2/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 100
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Couldn’t put the book down.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1XOB2GRLE8QZY/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 17, 2022",
  "reviewDescription": "I heard so much about this book on TikTok and decided why not try it. From the first page I knew I was hooked. You fall in love with the characters you feel the pain, the love, the hate. i’m not much of a reader but I read this book and four days. Absolutely love it and I cannot wait for the next part of this book. It’s a must read.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 81
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Rendered ‘nearly’ Speechless",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2JSBR5LTWQZJU/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 2, 2022",
  "reviewDescription": "This is not a love story, this is a tragic reality. I really did not want to like this book, but it was honestly one of the best books I’ve ever read. I think everyone should read this book, the messages within are painfully astounding. This book is an emotional roller coaster that made me grieve for what I hope I never have to experience and hate the reality that others have.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 82
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Good book- Wish there had been a trigger warning",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R16KCB1W75SUUU/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 30, 2022",
  "reviewDescription": "I couldn’t put this book down. That said, I wish I had known what kind of drama I was getting into! While it is a romance, there is a lot of domestic abuse. I appreciate that stories like this are told.. as many have said, it is easy to tell someone to walk away from an abusive relationship but so much harder to leave one as there is still a foundation of love.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 83
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "It ends with us",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R34H408Q1AWQ18/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 19, 2022",
  "reviewDescription": "No spoilers!!!I started reading this with low expectations. It caught my attention quickly, and it was a very fast read. It’s heartbreaking on so many levels and if you have a heart you’re going to cry. It is very well written. I’ll definitely be reading the second one!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 84
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "It’s a must!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RPZ8251XBCD7I/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 9, 2022",
  "reviewDescription": "I got it because tiktok kept telling me about this book I bought it and I couldn’t put it down .. finishes it in 2 days would of finished it that day night but unfortunately I have to sleep n work the next day that you so much! Brought tears to my eyes… but I love the naked truth…",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 85
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Prepare to ugly cry",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2ENE3RD4ZWOSD/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 14, 2022",
  "reviewDescription": "I thought I knew what I was getting into with this book as I read Colleen Hoover regularly but this book was not what I expected. It was much more emotionally driven than I was expecting and had me up quietly, ugly crying in bed with my husband sleeping next to me, while I was sucked in to the story. It is a beautifully written story of past and future.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 86
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Better Fifty Shades",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RCCVU2PMZCTGX/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 29, 2022",
  "reviewDescription": "Very good. Really got you thinking about tough subjects. Could be very triggering at times. If you want a very good, tough read. A little bit of a fifty shades vibe but much better written with quite a few twists.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 87
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Great Book",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3FDUMFHXUKUDB/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 15, 2022",
  "reviewDescription": "I love this book!!  From someone who has been physically abused by someone they loved…the depth of emotion and honesty this author describes is spot on.  Colleen Hoover put into words what I have been feeling but unable to articulate for years.  Impressive writing!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 88
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "An important and amazing read",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R31FJABUP02TV3/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 13, 2022",
  "reviewDescription": "“It Ends With Us” by Colleen Hoover.  Not my typical read of choice, but since it was so highly recommended by my wife and daughter, I interrupted another read for it. Don’t mistake this as a book as “for women,” - it is  an incredible perspective on a topic nobody should have to know about, but everyone should understand - abusive relationships. The book is exciting, amusing, frightening and extremely vulnerable. Read it.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 89
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Finished reading it in 2 days",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R5OWOKWJF5OSO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 25, 2022",
  "reviewDescription": "I enjoyed this book, as I finished reading it in under 48 hours. I liked the character, Lily. I think her reactions and thoughts and feelings regarding what she experienced in the story are realistic and relatable. I do feel the author really elevated every character to almost unrealistic levels of success in life which I found a bit farfetched. I look forward to reading the second book when it's released.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 90
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Hard to put down",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R991Y0JAE4SDB/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 28, 2022",
  "reviewDescription": "This was quite an interesting read that follows a young woman's journey through love at varying degrees.  I found a lot of it educational in the twists the story takes.  I don't want to give the plotline away, but it is definitely not your run-of-the-mill love story.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 71
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Holy emotions.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RU8YX1473S9IY/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "I wasn’t sure what to expect when I purchased this book. I hopped on the TikTok trend but let me tell you, I’m so glad I did. This book had me emotional throughout its entirety. I’ve already preordered the sequel to this and can’t wait for October.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 72
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Finished in a day",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R9VIGJWJMBO83/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 19, 2022",
  "reviewDescription": "I couldn’t put it down. I will admit the beginning did have me questioning my decision to hope on the bandwagon and read this book. However after the first chapter I couldn’t put it down. It has a really good storyline and message. It did feel a bit rushed at times but still not worth some of the bad reviews I’ve seen. I can’t wait for the 2nd book to come out. I’m super excited.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 73
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Relatable in so many ways",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R13YMTXQEXHCY4/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 2, 2022",
  "reviewDescription": "This book is well-written and relatable to so many people. If you've ever been mistreated in a relationship, need to get out of an abusive situation, have survived and broken free of that situation, or know someone in that situation who \"won't\" break free, you must read this. It gives a perspective from someone who lives this reality and from someone who doesn't understand this reality. This book is also a love story on several different levels - life partner, friendship, and parental relationship.  There are some graphic scenes, but the purpose of this book could not have been possible without the descriptions.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 74
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Couldn’t Put It Down!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1DUVDN0NZN6BD/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 10, 2022",
  "reviewDescription": "I am not an avid reader but bought this book based on some reaction videos. I could not put it down! I read it within a few days and passed it on to my sister to read it also. There is a sequel coming out in Oct and I cannot WAIT to read it. Buy this book!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 75
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Love and pain!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2Z81PSL2EQUYQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 13, 2022",
  "reviewDescription": "Coming from someone who witnessed abuse and was a victim of abuse herself, this book was incredibly hard to read but even harder to put down!! I cried, i cringed, i had to walk away a few times, but i loved this book and cant wait to read the next one",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 76
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "You won’t put it down",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1FBX0089D0XKO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 21, 2022",
  "reviewDescription": "This book was amazing. I loved everything about it. I couldn’t put it down. I read it in 3 days and I cannot wait for the second book to this series. I laughed cried and am in love with the characters of this story",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 77
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "amazing!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1WVHWN5OVB9ZO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 8, 2022",
  "reviewDescription": "Amazing! If you have been through this, it’s such a great read. I’m not a big reader but something told me to read it and I’m SO glad I did. So emotional but also so real and touching. I can’t wait to keep reading colleen’s books. Something tells me I will enjoy them with how real and raw this one is.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 78
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I cannot wait until part two!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R4CIQ9L36JZYO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 21, 2022",
  "reviewDescription": "This book is amazing! I started reading yesterday and I’m half way through it. Please hurry up with part two because I am on the edge of my seat! I’m loving Colleen Hoovers work and how she conveys so vividly to her audience.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 79
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "PSA: Check your binding before it’s too late to return!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1FRP0F1HAMWQK/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 31, 2022",
  "reviewDescription": "*This review is solely on the product itself not the novel*Finally decided to start this book and as I go to turn the page it just…… falls out? the binding of it must be made wrong because going through it I noticed many pages about to fall out. It’s a popular book at the moment so I’m assuming  overproduction and quality control are to be blamed.PSA: Check your binding before it’s too late to return!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/I/61XfSvmpr9L._SY88.jpg",
    "https://m.media-amazon.com/images/I/71jipl8rRHL._SY88.jpg"
  ],
  "position": 80
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I was not ready for the onslaught of emotions",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3JUCRCMLAQ6A7/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 21, 2022",
  "reviewDescription": "The good, the bad , and the ugly. This book has all the feels, even the ones you don't want. I was one chapter in, when I pre-ordered the sequel.To the author: I thank you for this book and I really thank you for your treatment of the subject matter. Mostly though I thank you for the Authors Note. Your \"naked truths\" made the book even better!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 51
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "One of the best books I’ve read in a long time",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RNJVEWCCP4VIS/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 29, 2022",
  "reviewDescription": "Beautiful written. Touched mu heart and can’t really wait until October for the next book. I haven’t felt this way about a book in a long time. Nor been happy and eager to leave a comment on one. I loved everything about this book. can’t wait to read the next and choose another book from this author. Love it!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 52
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "One of my favourite CoHo books, amazing!!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R41YGFYNMYDQC/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 3, 2016",
  "reviewDescription": "It Ends with Us by Colleen Hoover5 stars!!“There is no such thing as bad people. We’re all just people who sometimes do bad things.”So, this is what the morning after the night before feels like… no I was not wasted on alcohol or drugs (I’m tee-total and never touched drugs in my life) but this is an all new experience for me, a serious major book hangover. This was a book that brought me to my knees, both literally and figuratively. A book that was so all-consuming I could not put it down, not for one second. If I wasn’t reading it, I was listening to it.“Just keep swimming.”This is the book that kept me awake for most of the night as what transpired on those pages was dissected and analysed piece by piece. As my thoughts, feelings, opinions and emotions were spun around in my brain like a washing machine on full spin. These were the characters that never left me alone for a minute while my heart broke and my head hurt multiple, multiple times. This book was seriously that good and extremely thought provoking. This is a book that deserves to be read.“Everything is Better In Boston.”Colleen Hoover never ceases to amaze me. She is one of the few authors that I insist on going in blind, no synopsis, no reviews, nothing. She is the one author that I can guarantee will dazzle me with her natural, gifted talent. Writing that is pure, emotional, thought provoking, mesmerising, honest and multi layered. Layers upon layers of beautiful prose that you cannot help be consumed by and characters that are so realistic, so relatable that they consume you from first to last word. I lived and breathed It Ends with Us, raw, unadulterated story-telling at its finest. Colleen Hoover went above and beyond with this one, this was from the heart, from life experiences, I felt the honesty, the pain, the passion, every word, every sentence, every paragraph, every page, every chapter was written in Colleen Hoover’s blood and you knew it and you most definitely felt it. This was Colleen Hoover in words. This woman who is the epitome of humble, selfless, generous put herself out there and it is one book that I will never, ever, forget.“…I have never felt this alone. This broken. This angry. This hurt.”Lily Bloom was a stunning character, like Colleen Hoover herself, she was selfless and humble. She put others before herself, her personality was intoxicating and Colleen Hoover did an amazing job bringing her to life. While her story definitely has its ups and downs, Lily dealt with them maturely and with all the best intentions, while trying to keep herself and everyone else around her happy. Heart breaking decisions that were tough to make and harder to break, but made her stronger. Lily was a woman that learned from past mistakes, made by herself and those around her, she soaked up life experiences like a sponge and her positivity and empathy made her the woman she was. She was endearing, lovable she was just darn perfect.“One monumental life-changing thing at a time. Got it.”This is not a love triangle, far from it. This is a story about a woman that has only ever loved twice, and when she loves, she loves completely. Atlas was her first love, a boy that had nothing but gave everything. A boy that was her best friend, her confidante, her boyfriend until life wrenched him away. He had to do what he had to do but it didn’t make his loss any easier to take.“You saved my life, Lily…And you weren’t even trying.”Ryle, I adored him, despite his flaws, he was a man that wanted to be better, to be the man that Lily deserved. He had never loved, never wanted to, nor thought he deserved it, but meeting Lily changed everything, she was his game changer. What he had always thought was out of reach he grabbed with both hands. He loved hard, he loved fierce, he was passionate, protective and just a stunning human being, but even the biggest diamond has its imperfections.“It’ll destroy him for life, that’s what it’ll do.”The naked truth? Colleen Hoover destroyed me, one scene in particular I have running around my head on repeat and as I am sitting here typing I have streams and streams of tears running down my face. As much as I was uplifted and totally consumed by Lily’s story I had a deep sense of foreboding throughout. What I thought would happen, didn’t, thankfully, but having that in the back of mind constantly only added to my sense of unease and with each page turned I felt more and more sick. But and this is a huge BUT, nothing could have prepared me for how this book turned out. Definitely the right ending, but the raw, emotional out pouring onto those pages decimated me. My heart physically ached, I was distraught and at the end I wanted more. It may have ended with It Ends with Us (that title is PERFECT, the meaning behind it, gah, brought me to tears yet again) but all these characters have more to give, more life lessons to make and I’m hoping that Colleen Hoover can find it in her emotional arsenal to write more.“It stops here. With me and you. It ends with us.”Once again I bow down to the greatness that is Colleen Hoover, how can I read a book after that?“You can stop swimming now, Lily. We finally reached the shore.”",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 53
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "A must read!!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1PIDCVHR85TES/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 27, 2022",
  "reviewDescription": "I am an avid reader and I have never been as compelled to write a review the second I close the cover of a book. This book is so compelling, heart wrenching, well written, and honest. Thank you Colleen, for having the strength to write this book. I am a forever fan, like millions of others.  Thank you.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 54
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Keeps you reading",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R12DI2U94GY41S/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 30, 2022",
  "reviewDescription": "I am not much of a reader but I bought the book for my daughter and she insisted that I read the book. I read it and it pulled me in, I wanted to keep reading even at work when I was supposed to be working. The author is amazing and I already pre-ordered the second book for us.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 55
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "READ IT!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R11C2RHYTW262A/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "Every. Single. Soul. Needs. To. Read. This. Book. I’m not kidding when I tell you this is my top 3 favorite novel of all time. I’ve only had this book a week and I’ve already read it twice! I preordered It Starts With Us (book 2) because I’m THAT excited to continue the story. Just do it, get the book. You won’t regret it.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 56
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Couldn’t put it down!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2U1O4NQ1KW0ZC/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 30, 2022",
  "reviewDescription": "You really feel so close with each individual character and are rooting for each of them the whole time. I could truly imagine what the settings looked like and felt like I was there. I wish I could read it again for the first time! And now I can’t wait for the next one to come out",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 57
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "A must read!!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1WPDWNDGL29MI/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 4, 2022",
  "reviewDescription": "Oh my goodness!! I have been in a slump lately, and I was supposed to read this book months ago in a buddy read. I just now got to it, I had so many emotions while reading this book, the ending had me balling my eyes out.I love Lily, her bravery and strength! I also loved Atlas with how kind, thoughtful, and just amazing he is.I liked Ryle in the beginning, but then I grew to hate him. Lily’s mother and her words to Lily to let her know she’s better than that, brought me so many more tears.Everyone should read this book!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 58
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I LOVE IT!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3U7DREG2R7WRB/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 19, 2022",
  "reviewDescription": "I’m really not a person who reads, but I wanted to get back into reading so my friend suggested this book to me. By the second page I was so locked into reading it, it’s like I was in my own world. I couldn’t stop reading it! 10/10 recommend!!I also can’t wait for “It Starts With Us” to come out!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 59
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "There are not enough words!!!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2YAQWWG3J7WAU/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "This story will break your heart. It will strengthen you in ways you can't imagine it is love personified. I would recommend this book to anyone! Its my first book by this author and I will now be reading ALL of her books! I stayed up until 2 am to finish and it was WORTH IT!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81UsHsdUnML._SY88.jpg"
  ],
  "position": 60
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Finally read it after months on KU Romances",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1EHKL0BNG56YR/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "9 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "So much hype over this book! I've read dozens and dozens of KU Romances across every genre - billionaire, mafia, same sex, enemies to lovers, second chance, dark, light, everything in between. There is some really good content over there so I finally wanted to see how they compared to one of the best selling romance novels of all time. Selfishly I also wanted to see how Hoover's writing (this is my first of hers i've read) compared to Sylvia Day whose Bared series I loved Books 1-3.Overall I give this a 4 stars. It didn't completely bowl me over but overall really good. One little admission is that I totally skipped the pages and pages and pages of \"journal entries\" aka back story for Lily and Atlas, and guess what? Still was able to figure out the story just fine :) It came across to me as filler and really slowed the plot down but I know some readers love those juicy details. I just wanted to get back to the main story line and honestly some of the entries were like 12 pages long. If you wanna do the same, I won't tell anybody and I promise you won't be lost.Spoilers ahead.This book honestly wasn't as dark as I thought it would be given all the talk of domestic violence. I thought it would be scene after scene, but there were only 3 incidents in the whole book, 2 of which were somewhat unintentional and/or partially happenstance, while the third was just nauseatingly purposeful. Some of the MC (Lily) reactions seemed a little fake or contrived, and especially I DID not like it when she informed Ryle WHILE HE HELD HIS NEWBORN BABY that she wanted a divorce. Surely she could have waited a day? I don't like when books make me dislike a protagonist and up until this very point at the end, I had really liked Lily.Ryle and his thought processes were right on. Having experience with men with major emotional trauma this really hit home for me and seemed incredibly realistic. There are two types of abusers in my opinion - the ones who are truly mean and don't care that they are hurting others and the the ones with the demons they can't control. Him putting on Lily by saying \"help me\" as though its up to her to heal him was really on point (if very, very wrong - he is responsible for his own healing).Anyway, overall pretty well done if a little too much filler in the middle of the book. The ending was pretty superb and that Epilogue! I have to admit I was rooting for Atlas the whole time, but I have a weak spot for rescuers. Unfortunately I didn't really get invested in any of the characters enough to want to spend the money or time on It Starts with Us, which starts where EWU leaves off. I think I'll move on to Ugly Love which I heard was steamier and is a little more along my preference lines.TBH if you are looking for pure drama and emotional angst Sylvia Day's Book 1 of Bared series is going to leave you gasping, its way more fast paced. Unfortunately though the series drops off in quality after book 3, and one thing CoHo fans love is her consistency.HTH!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 21
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1DC45AZ5WS3PZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "20 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2016",
  "reviewDescription": "*Review originally posted on Goodreads*'I wish cutting my feelings off for the person who hurt me was as easy as I used to think it would be. Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.'It Ends With Us was beautifully complicated. It was hot and cold. Up and down. Good and bad. Beautiful and ugly... I'm still trying to figure out how I really feel about it all because I'm genuinely torn on how I want to perceive this storyline. I loved it but in all honesty, I really do think I hate it as well. Not the \"I-hate-you-Colleen-Hoover-stop-writing-books-and-find-a-different-career\" type of hate but rather \"I-hate-you-Colleen-Hoover-for-making-me-hate-everything-that-I-came-to-love\" kind of hate because it pretty much summarizes all my thoughts and feelings about It Ends With Us in one sentence.My opinions were completely divided. One side of me, the hopeless romantic, was utterly unsatisfied and angry with the outcome of the story. The opposite side, the one that's all about women's empowerment, was cheering on #TeamLily like it was Independence Day.Rather than trying to sugarcoat my thoughts, I'm just going to be completely honest. I was 100 percent team Ryle from the very first time we met him. Just like Lily, I fell in love with every word and every gesture that rolled off of his body. I. WAS. HOOKED. It also didn't help that I kept fantasizing Doctor Mike as Ryle Kincaid. *heart eyes emoji* I loved his ambition. His personality. His confidence. To be honest, I think I might've loved Ryle even more than Lily did but that's another story for another day. That more than likely explains why I took the second half of this book like a blow to the gut.Once we got to the second half of the book, that's where it started going a bit downhill for me as a Ryle and Lily shipper. Every happy moment that ever happened between my ship came barreling down as it collided with pain and abuse. I was angry. I was thrashing. I was yelling at the pages in front of me, \"Why are you doing this Colleen?!\" But most importantly, I was just heartbroken to see such a beautiful couple become so toxic. Everything I loved about the first half of the book was slowly unraveling right before my very eyes as if it never really existed in the first place. I can't even remember how many times I wanted to put the book down because my hopeless romantic self just couldn't handle it anymore. But I just kept on reading because I was guiltily hoping that Ryle and Lily would still have their happy ending despite all that had happened. :/ Sadly, this was where I was torn the most.I have the upmost respect for Lily. She is definitely one of my favorite female characters that Colleen has ever created because she did what a lot of us would've struggled to do in the end: walk away. Lily was such a strong character and I admire her so much for having the strength to stand up for herself. There were numerous times towards the end of the book where I knew I probably would've gave in and forgave Ryle for his actions but Lily was inflexible. She was in a tough position but she put her foot down and demanded better for herself. In the end, no matter if I ship Ryle/Lily or Atlas/Lily, I'm glad that Lily was able to find peace for her and Emmy.As for Atlas, I liked him but I didn't love him. Definitely nowhere near my love for Ryle. I wasn't exactly rooting for Atlas but I wouldn't have minded if Lily chose him in the end. However, I still very much preferred Ryle regardless. I just felt that Atlas was the typical knight in shining armor. Typical good guy you run to. His background story was interesting but him as a character... not so much. He just felt so ordinary and predictable. I wanted to ship Atlas and Lily because let's face it, the signs were practically being shoved down our throats, and although the relationship between Ryle and Lily was developing, Atlas's presence was a like a thorn on your side you just couldn't shake off. But I just couldn't bring myself to ship them blindly like I did with Ryle and Lily.Unfortunately, I was too far gone and too far in love with the idea of Ryle and Lily to make room for Atlas and because of that, I'm not sure if I'll ever be fully satisfied with that ending. I was happy that Lily was no longer a victim of domestic abuse. I'm glad that after all that happened between them, Lily and Ryle parted on good terms. I'll forever be heartbroken over the idea of what could've been. And I feel indifferent to Lily and Atlas. Sorry not sorry, Atlas. That basically sums up all my feelings in a nutshell.To be honest, I was actually feeling a bit more bitter than I'm making it seem after that ending. But after reading the author's note, it really put things in perspective for me and made me look at the story with brand new eyes. I developed a new understanding and appreciation for the story behind the story.I was dying for Ryle and Lily to have their happy ending. Until the very end, I was still rooting for them. It's such an ugly confession to make especially when the couple you're rooting for is toxic and abusive. And I think I feel this way because I never, and hopefully I never will, had to experience abuse. I don't know what it's like and what goes on in the minds of the abused. Colleen did such an excellent job at creating the perfectly imperfect man that was Ryle. Abuse in books has always been a trigger for me and if it were any other book I think I would've put this book down by the first incident of abuse. But Colleen just made you fall so deeply in love with a character that even you couldn't bring yourself to hate him even if you wanted to. YOU were the Lily of this story. But unfortunately, I don't think my Lily would've had the courage to leave. I really wish I could say that I would leave in an instant, but I think I would honestly be lying to myself. You can tell yourself that if you were in Lily's position you would leave in a blink of an eye, but things wouldn't be as easily said and done if you were the one who was actually experiencing it all. And in truth, I think this is exactly what Colleen wanted us to actually sit down and think about because victims who've experienced abuse wouldn't be rooting for Ryle and Lily. I wouldn't be rooting for Ryle and Lily. It just goes to show how much of a struggle it really is to walk away from someone you love and loves you back in all the wrong ways. I usually never read the author's notes after the book but I'm really glad I took the time to read Colleen's story. It really did make me see the situation from a different perspective.I'd been having a bad CoHo streak for three books in a row (if you're curious, the books were — in order — Hopeless, November 9, and Too Late) and for a moment there I was beginning to think that I was doomed to never enjoy another book written by Colleen Hoover again. But PRAISE. It Ends With Us restored my faith completely in the CoHo hype. Not that I was ever planning NOT to read any more of Colleen's books! Colleen Hoover is 100 percent my favorite auto-buy author. I will always buy her books no matter if I end up loving them or not, and with good reason because Colleen is such an exceptional writer. It Ends With Us still wasn't able to top Ugly Love as my favorite CoHo book of all time but I really enjoyed this book more than I thought I would.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 22
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I COULD NOT PUT THIS BOOK DOWN.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1SYA6SUVHNITL/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "29 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 11, 2022",
  "reviewDescription": "This book.... OHHH my gosh. This book was so heart-wrenching, yet so beautiful at the same time. Coming from someone who has experienced domestic violence in the past it really hits home. When I first bought this book I didn't know what to except, but it wasn't this. It was everything I could've hoped for and MORE. I loved the way she portrayed Lily. She was so courageous, bold, relatable and perfect in all the right ways. I cannot wait for book 2!!! Once I finished, I couldn't stop crying for a whole hour straight. I can't even remember turning pages because it had me hooked that good!! READ IT READ IT READ IT!*SPOILERS*]First off, some of these reviews piss me off, especially the ones that are geared toward the main character Lily.\"Why did Colleen have her stay with someone who was constantly abusing her and treating her as so\"?\"I was so pissed she got right with Atlas right after the whole thing with Ryle happened, that would not happen in real life...\"First off, if you have ever experienced domestic violence in your life you would know how hard it is to leave the situation. Second, did you even read the book? Lily clearly states her confusion with either staying or leaving. It's not like she was staying with him because she liked the abuse?! Some of yawl's reviews seriously get to me. Imagine falling in love with someone who was absolutely perfect in your eyes and treated you in all the ways you'd ever imagine. You then get tied down... He starts to abuse you... Does things to you that you never thought this man who loved you SO much could possibly do?!? But it happens. It's not that easy to up in leave... If you TRULY knew what it is like to experience domestic abuse you would know that. So please stop getting mad at Lily for taking so long to leave! The whole thing about her getting with Atlas so fast after the whole dealio with Ryle ended, was PERFECT in my eyes. People are getting mad at how quickly she got back with him, but he was her safe place and FIRST true love (who matter-of-fact she never fell out of love with). I would've done the exact same dang thing!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 23
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Every woman should read this book",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1ASM5ROQC4Z16/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "32 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 17, 2022",
  "reviewDescription": "I have never been inspired to write a book review. This is my first. I read all the critical reviews, but the subject matter of this book hit a very sensitive nerve for me. First of all, for those who thought the book was too sensual or too emotional, I must venture a guess this subject matter is something they have never lived or even thought was possible.Domestic abuse has many sides and many questions. If you have not been a victim, it might be easy to say,”Why didn’t you leave?” This book answers many questions and explores the victims and abusers viewpoints. The most prominent quotation in this book for me is, “There are no bad people, only people who do bad things.” I believe the circumstances of our childhoods shape us into the adults we become, even more than genetics. The traumas we have to survive and the way we are made to feel about ourselves stay with us.I was a survivor of my parents abuse of each other. It was not just my father, but also my mother who fought violently with each other. I was able to go to university and leave the trauma physically, but not emotionally.I married the first man who proposed so I didn’t have to go home.I withstood his verbal and physical abuse for 28 years. He stopped hurting me before my bruises and choking so as not to send me to the hospital. I stayed with him for 28 years because he was a good father and my daughters loved him.I loved him because when he was good, he was very good. Was I stupid? Was I afraid to go out on my own? Yes. My children came first. I would endure anything for their safety and happiness.This amazing book addresses both sides of abuse, from each perspective. The heartbreak of having to decide your future with a man you love with all your heart, who loves you with everything he has in him, but who also has demons he is unable to control.Please read this book. It will give you sight into this ongoing tragedy between men and women. Withhold your judgment until the end, if you have the wisdom to do so",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 24
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "this book ripped me apart but made me yearn for love at the same time",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3VF1JYY5ESIQQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 26, 2022",
  "reviewDescription": "so this was my first book that ive read in probably 4 years. i only listen to harry potter at night to fall asleep lol so this was the first real adult book ive really ever read. at first i didnt like it because the first chapter seemed to drag on forever. i felt like i wasnt getting any insight into the characters and the whole plot was just kinda boring until about 1/4 of the way into the book. and then i was hooked. i finished this book in 3 days. i cried so many times because of how beautiful it was, especially lily's love with atlas. but i also cried because of how horrible it was, the abuse with ryle but also with lily's parents. it was just such a beautiful, sad book. i know a lot of people didnt like the journal entries where lily was writing about atlas but i LOVED THEM. the plotline with atlas was my favorite part of the book i LOVE him. his and lily's relationship was so sweet. i cant wait to read more about them in it starts with us. overall a very good read that will have you smiling and then sobbing within minutes. RECOMMEND!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 25
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "The Start to my Coho Obsession",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1BOSZ28SJ60U1/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "This book was something that I believe is the epitome of powerful woman doing what’s better for them and learning from others mistakes. Lily’s character was something I felt was someone I can relate to because I have seen how domestic violence can ruin a person and how hard it is to walk away from that person. It takes a lot of courage to do that, and the way this book’s plot developed was from a girl ready to accept the fate of the beaten house wife , but then she knew this isn’t what she was in Boston for . She wanted better than the future her mother already lived . In my heart of hearts , if you want a book that will keep you on the edge of your seat with the play on words but also can rip ur heart out and cry . then this is the book for you !!!!! plz read <3",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 26
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "If you don’t already have this… WHY NOT?!?!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2ML621WX04W8Z/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 25, 2022",
  "reviewDescription": "I am an avid ready. Lately I haven’t been reading as much as I once did due to working, raising kiddos, and taking care of the daily household things and when I did find the time to read, I usually entertained the education/self help books. I saw a co-worker reading this a few weeks ago at work and she couldn’t say enough positive things about it. I was a Twilight enthusiast back in middle school and have fond memories of reading that series and escaping from my real-life problems. I decided that life is too serious to use what little leisurely time I had available for reading on just education/self help and the take a dive back to the genre that captivated me back then. And Man. BEST. DECISION. Seriously, if you are on the fence for any reason, hope OFF and read this. Honestly, read all of Colleen Hoover’s books.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 27
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Wow",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RZ1QN1AXBDY2X/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "4 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2022",
  "reviewDescription": "I just want to start off by saying that I am 26 years old and I’ve never picked up a book in my life. I always swore I hated reading. After all my clients and co workers were telling me to read this book I said ok it’s worth a shot. Since the day I picked up this book I haven’t been able to put it down. I think about reading it all day at work. I read it on my lunch break and any chance that I get. Today I have finished the book and I decided to leave a review because I give credit when credit is due.. this book was AMAZING! I laughed I cried I felt every emotions I never knew a book could make me feel. In my 26 years I’ve finally read a whole book and I am so happy. I already pre ordered part 2 to this book and followed the author on IG lol. Thank you Colleen Hoover for being a bad ass author!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 28
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Not just another romance novel. This book will rip your heart out.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1Z8PBBD7G8UXI/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "6 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "She makes you fall in love with him, then rips your heart out and makes you wish it didn’t end that way. Amazing writing. I started out thinking it was just another romance novel, but I was COMPLETELY WRONG! This book makes you feel so many things, and makes you scream in your head at what you hope the outcome will be. I love that she helps show the women’s side of abuse to help people understand what goes through their mind and why they can’t just leave.My three favorite lines:“People spend so much time wondering why the women don’t leave. Where are all the people who wonder why the men are even abusive? Isn’t that where the only blame should be place?” 🙌 Yaaaas“Sometimes the things that matter to you most are also the things that hurt you the most. And in order to get over that hurt, you have to sever all the extensions that keep you tethered to that pain.”“We break the pattern before the pattern breaks us.”",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 29
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "especially wearing his adorable scrubs, is easy on the eyes and such ...",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2RVOWHQ5OY9CZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2016",
  "reviewDescription": "THE STORY:Lisa: I went into this story completely blind. I do this quite a bit, honestly, and it almost always pays off. But with this book especially, I think going in blind is the way to go. If that’s not your reading style, I’ll give you just a bit of background.Lily hasn’t lived the easiest life. After graduating from college she moved to Boston where she opened her own business. Things were finally looking up for her. All of her hard work had paid off. She runs into a local neurosurgeon and immediately feels a connection with him. Ryle, especially wearing his adorable scrubs, is easy on the eyes and such a charmer. He’s also a player and only wants one-night-stands. He refuses to get into a relationship for several reasons, one of them being he just doesn’t have the time outside of being a doctor to be in a real relationship. The sparks start flying and Lily realizes she’s quite interested in Ryle… that is, until a blast from her past, Atlas, reappears, and brings up allllll kinds of confusing feelings.Becca: Yes! I 100% agree with Lisa, if you can go into this one blind then I recommend that you do! It was absolutely incredible to experience each moment and have no idea what was going to happen next!I don’t want to say too much and spoil the story for anyone. I will say that this book does span a large part of Lily’s life. We see her as a teen and also as an adult, it was very well done and I enjoyed the blend of past and present.THE CHARACTERS:Becca: Oh these characters… where do I begin?! I absolutely loved Lily! She had been through so much in her life, yet she persevered and followed her dreams. She was strong and fought for what she believed in. I loved learning about her past and being with her in the present. I felt as though I knew her, I understood and empathized with very thought and every emotion.When Lily met Ryle, I fell for him as instantaneously as she did. He was strong, confident, funny and of course sexy in scrubs ;) Their relationship was a whirlwind that wrapped them up so quickly and I was in it with them! When things got tough for them, I felt every moment as harshly as they did.When Atlas (the blast from Lily’s past) appears it throws this whole story in a different direction. Of course, we meet him with young Lily and then again later in the book. Atlas has this smooth, quiet confidence about him. He comes from absolutely nothing and makes something out of himself. I admired and respected him and I fell for him big time!I know some of you are probably sniffing out a love triangle and freaking out. In my opinion, that is NOT what this is. Some may call it a love triangle on a technical basis, but it really is not and I urge you not to skip this one for that reason because that term is to cliched for what this book actually is.Also the secondary characters in this book, Lily’s parents and Ryle’s sister and her husband are truly imperative in this story. They are just perfect and add so much to the story.I do not think that there is another Author out there who can make me fall in love with characters quite so hard. CoHo develops her characters so well that I feel as though I know them! I had so many feels for these characters that my heart couldn’t handle it! In the past I have loved many CoHo characters (and I still do) but none made me feel what these characters did and none made me feel quite so much that I was a part of their story. Trust me when I say these are characters that you want to meet.Lisa: That’s so, so true, Becca! I agree that CoHo has an amazing ability to make us fall in love with ALL characters, even the not-so-easy-to-love ones.I’m honestly not sure I would categorize this as a love triangle. I know others have, but I disagree. (view spoiler)My favorite characters in this story were, as Becca mentioned, the secondary characters. Specifically Ryle’s sister and her husband, who are wonderful additions to this beautiful story. I also enjoyed the family dynamics and how everyone had each others’ backs when it was most important.TO SUM UP:Lisa: WOW! Just… wow! This has got to be the BEST book Colleen Hoover has written to date. The stark honesty and impacting nature of this story will punch you in the feels. Hard. I’ve never experienced an abuse story to quite this level. I was blown away by this story and left a babbling ball of nerves and tears. A book hasn’t touched me this deeply in quite some time. I also learned quite a bit from this story. We’re always so quick to judge in instances of abuse… but there’s so much more to the story than you see with the naked eye. Don’t judge. Don’t assume facts that aren’t true. And, most importantly, don’t ever think it can’t happen to you or someone you know. Such a strong story that is sure to impact every reader that opens the cover in one way or another. I’m leave completely blown away by this story, as well as hopeful, which is such a wonderful thing. Colleen, you’ve done it AGAIN!Becca: I know some of you may think that I always say this and yes I am a true CoHo fan, but this is by far her best work ever. It Ends With Us is so raw and full of emotions, but most of all it is honest. I cried… A LOT! And I am not talking a few tears or a quiet wimper… I am talking ugly crying that I couldn’t contain. The message it delivers is a powerful one and I know that this is a book that will stay with me forever. Please make sure that once you are done you read the Author note at the end, it will give you an even better view of this book afterward.Colleen Hoover, you slay me with your words. You break my heart and then put the pieces back together. You are an amazing writer and I believe you are a gift for readers like myself. Keep doing what you are doing and I will keep reading everything that you write.(Thanks to Atria Books for the review copy!)",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 30
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Finally read it after months on KU Romances",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1EHKL0BNG56YR/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "9 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "So much hype over this book! I've read dozens and dozens of KU Romances across every genre - billionaire, mafia, same sex, enemies to lovers, second chance, dark, light, everything in between. There is some really good content over there so I finally wanted to see how they compared to one of the best selling romance novels of all time. Selfishly I also wanted to see how Hoover's writing (this is my first of hers i've read) compared to Sylvia Day whose Bared series I loved Books 1-3.Overall I give this a 4 stars. It didn't completely bowl me over but overall really good. One little admission is that I totally skipped the pages and pages and pages of \"journal entries\" aka back story for Lily and Atlas, and guess what? Still was able to figure out the story just fine :) It came across to me as filler and really slowed the plot down but I know some readers love those juicy details. I just wanted to get back to the main story line and honestly some of the entries were like 12 pages long. If you wanna do the same, I won't tell anybody and I promise you won't be lost.Spoilers ahead.This book honestly wasn't as dark as I thought it would be given all the talk of domestic violence. I thought it would be scene after scene, but there were only 3 incidents in the whole book, 2 of which were somewhat unintentional and/or partially happenstance, while the third was just nauseatingly purposeful. Some of the MC (Lily) reactions seemed a little fake or contrived, and especially I DID not like it when she informed Ryle WHILE HE HELD HIS NEWBORN BABY that she wanted a divorce. Surely she could have waited a day? I don't like when books make me dislike a protagonist and up until this very point at the end, I had really liked Lily.Ryle and his thought processes were right on. Having experience with men with major emotional trauma this really hit home for me and seemed incredibly realistic. There are two types of abusers in my opinion - the ones who are truly mean and don't care that they are hurting others and the the ones with the demons they can't control. Him putting on Lily by saying \"help me\" as though its up to her to heal him was really on point (if very, very wrong - he is responsible for his own healing).Anyway, overall pretty well done if a little too much filler in the middle of the book. The ending was pretty superb and that Epilogue! I have to admit I was rooting for Atlas the whole time, but I have a weak spot for rescuers. Unfortunately I didn't really get invested in any of the characters enough to want to spend the money or time on It Starts with Us, which starts where EWU leaves off. I think I'll move on to Ugly Love which I heard was steamier and is a little more along my preference lines.TBH if you are looking for pure drama and emotional angst Sylvia Day's Book 1 of Bared series is going to leave you gasping, its way more fast paced. Unfortunately though the series drops off in quality after book 3, and one thing CoHo fans love is her consistency.HTH!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 11
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1DC45AZ5WS3PZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "20 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2016",
  "reviewDescription": "*Review originally posted on Goodreads*'I wish cutting my feelings off for the person who hurt me was as easy as I used to think it would be. Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.'It Ends With Us was beautifully complicated. It was hot and cold. Up and down. Good and bad. Beautiful and ugly... I'm still trying to figure out how I really feel about it all because I'm genuinely torn on how I want to perceive this storyline. I loved it but in all honesty, I really do think I hate it as well. Not the \"I-hate-you-Colleen-Hoover-stop-writing-books-and-find-a-different-career\" type of hate but rather \"I-hate-you-Colleen-Hoover-for-making-me-hate-everything-that-I-came-to-love\" kind of hate because it pretty much summarizes all my thoughts and feelings about It Ends With Us in one sentence.My opinions were completely divided. One side of me, the hopeless romantic, was utterly unsatisfied and angry with the outcome of the story. The opposite side, the one that's all about women's empowerment, was cheering on #TeamLily like it was Independence Day.Rather than trying to sugarcoat my thoughts, I'm just going to be completely honest. I was 100 percent team Ryle from the very first time we met him. Just like Lily, I fell in love with every word and every gesture that rolled off of his body. I. WAS. HOOKED. It also didn't help that I kept fantasizing Doctor Mike as Ryle Kincaid. *heart eyes emoji* I loved his ambition. His personality. His confidence. To be honest, I think I might've loved Ryle even more than Lily did but that's another story for another day. That more than likely explains why I took the second half of this book like a blow to the gut.Once we got to the second half of the book, that's where it started going a bit downhill for me as a Ryle and Lily shipper. Every happy moment that ever happened between my ship came barreling down as it collided with pain and abuse. I was angry. I was thrashing. I was yelling at the pages in front of me, \"Why are you doing this Colleen?!\" But most importantly, I was just heartbroken to see such a beautiful couple become so toxic. Everything I loved about the first half of the book was slowly unraveling right before my very eyes as if it never really existed in the first place. I can't even remember how many times I wanted to put the book down because my hopeless romantic self just couldn't handle it anymore. But I just kept on reading because I was guiltily hoping that Ryle and Lily would still have their happy ending despite all that had happened. :/ Sadly, this was where I was torn the most.I have the upmost respect for Lily. She is definitely one of my favorite female characters that Colleen has ever created because she did what a lot of us would've struggled to do in the end: walk away. Lily was such a strong character and I admire her so much for having the strength to stand up for herself. There were numerous times towards the end of the book where I knew I probably would've gave in and forgave Ryle for his actions but Lily was inflexible. She was in a tough position but she put her foot down and demanded better for herself. In the end, no matter if I ship Ryle/Lily or Atlas/Lily, I'm glad that Lily was able to find peace for her and Emmy.As for Atlas, I liked him but I didn't love him. Definitely nowhere near my love for Ryle. I wasn't exactly rooting for Atlas but I wouldn't have minded if Lily chose him in the end. However, I still very much preferred Ryle regardless. I just felt that Atlas was the typical knight in shining armor. Typical good guy you run to. His background story was interesting but him as a character... not so much. He just felt so ordinary and predictable. I wanted to ship Atlas and Lily because let's face it, the signs were practically being shoved down our throats, and although the relationship between Ryle and Lily was developing, Atlas's presence was a like a thorn on your side you just couldn't shake off. But I just couldn't bring myself to ship them blindly like I did with Ryle and Lily.Unfortunately, I was too far gone and too far in love with the idea of Ryle and Lily to make room for Atlas and because of that, I'm not sure if I'll ever be fully satisfied with that ending. I was happy that Lily was no longer a victim of domestic abuse. I'm glad that after all that happened between them, Lily and Ryle parted on good terms. I'll forever be heartbroken over the idea of what could've been. And I feel indifferent to Lily and Atlas. Sorry not sorry, Atlas. That basically sums up all my feelings in a nutshell.To be honest, I was actually feeling a bit more bitter than I'm making it seem after that ending. But after reading the author's note, it really put things in perspective for me and made me look at the story with brand new eyes. I developed a new understanding and appreciation for the story behind the story.I was dying for Ryle and Lily to have their happy ending. Until the very end, I was still rooting for them. It's such an ugly confession to make especially when the couple you're rooting for is toxic and abusive. And I think I feel this way because I never, and hopefully I never will, had to experience abuse. I don't know what it's like and what goes on in the minds of the abused. Colleen did such an excellent job at creating the perfectly imperfect man that was Ryle. Abuse in books has always been a trigger for me and if it were any other book I think I would've put this book down by the first incident of abuse. But Colleen just made you fall so deeply in love with a character that even you couldn't bring yourself to hate him even if you wanted to. YOU were the Lily of this story. But unfortunately, I don't think my Lily would've had the courage to leave. I really wish I could say that I would leave in an instant, but I think I would honestly be lying to myself. You can tell yourself that if you were in Lily's position you would leave in a blink of an eye, but things wouldn't be as easily said and done if you were the one who was actually experiencing it all. And in truth, I think this is exactly what Colleen wanted us to actually sit down and think about because victims who've experienced abuse wouldn't be rooting for Ryle and Lily. I wouldn't be rooting for Ryle and Lily. It just goes to show how much of a struggle it really is to walk away from someone you love and loves you back in all the wrong ways. I usually never read the author's notes after the book but I'm really glad I took the time to read Colleen's story. It really did make me see the situation from a different perspective.I'd been having a bad CoHo streak for three books in a row (if you're curious, the books were — in order — Hopeless, November 9, and Too Late) and for a moment there I was beginning to think that I was doomed to never enjoy another book written by Colleen Hoover again. But PRAISE. It Ends With Us restored my faith completely in the CoHo hype. Not that I was ever planning NOT to read any more of Colleen's books! Colleen Hoover is 100 percent my favorite auto-buy author. I will always buy her books no matter if I end up loving them or not, and with good reason because Colleen is such an exceptional writer. It Ends With Us still wasn't able to top Ugly Love as my favorite CoHo book of all time but I really enjoyed this book more than I thought I would.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 12
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I COULD NOT PUT THIS BOOK DOWN.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1SYA6SUVHNITL/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "29 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 11, 2022",
  "reviewDescription": "This book.... OHHH my gosh. This book was so heart-wrenching, yet so beautiful at the same time. Coming from someone who has experienced domestic violence in the past it really hits home. When I first bought this book I didn't know what to except, but it wasn't this. It was everything I could've hoped for and MORE. I loved the way she portrayed Lily. She was so courageous, bold, relatable and perfect in all the right ways. I cannot wait for book 2!!! Once I finished, I couldn't stop crying for a whole hour straight. I can't even remember turning pages because it had me hooked that good!! READ IT READ IT READ IT!*SPOILERS*]First off, some of these reviews piss me off, especially the ones that are geared toward the main character Lily.\"Why did Colleen have her stay with someone who was constantly abusing her and treating her as so\"?\"I was so pissed she got right with Atlas right after the whole thing with Ryle happened, that would not happen in real life...\"First off, if you have ever experienced domestic violence in your life you would know how hard it is to leave the situation. Second, did you even read the book? Lily clearly states her confusion with either staying or leaving. It's not like she was staying with him because she liked the abuse?! Some of yawl's reviews seriously get to me. Imagine falling in love with someone who was absolutely perfect in your eyes and treated you in all the ways you'd ever imagine. You then get tied down... He starts to abuse you... Does things to you that you never thought this man who loved you SO much could possibly do?!? But it happens. It's not that easy to up in leave... If you TRULY knew what it is like to experience domestic abuse you would know that. So please stop getting mad at Lily for taking so long to leave! The whole thing about her getting with Atlas so fast after the whole dealio with Ryle ended, was PERFECT in my eyes. People are getting mad at how quickly she got back with him, but he was her safe place and FIRST true love (who matter-of-fact she never fell out of love with). I would've done the exact same dang thing!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 13
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Every woman should read this book",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1ASM5ROQC4Z16/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "32 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 17, 2022",
  "reviewDescription": "I have never been inspired to write a book review. This is my first. I read all the critical reviews, but the subject matter of this book hit a very sensitive nerve for me. First of all, for those who thought the book was too sensual or too emotional, I must venture a guess this subject matter is something they have never lived or even thought was possible.Domestic abuse has many sides and many questions. If you have not been a victim, it might be easy to say,”Why didn’t you leave?” This book answers many questions and explores the victims and abusers viewpoints. The most prominent quotation in this book for me is, “There are no bad people, only people who do bad things.” I believe the circumstances of our childhoods shape us into the adults we become, even more than genetics. The traumas we have to survive and the way we are made to feel about ourselves stay with us.I was a survivor of my parents abuse of each other. It was not just my father, but also my mother who fought violently with each other. I was able to go to university and leave the trauma physically, but not emotionally.I married the first man who proposed so I didn’t have to go home.I withstood his verbal and physical abuse for 28 years. He stopped hurting me before my bruises and choking so as not to send me to the hospital. I stayed with him for 28 years because he was a good father and my daughters loved him.I loved him because when he was good, he was very good. Was I stupid? Was I afraid to go out on my own? Yes. My children came first. I would endure anything for their safety and happiness.This amazing book addresses both sides of abuse, from each perspective. The heartbreak of having to decide your future with a man you love with all your heart, who loves you with everything he has in him, but who also has demons he is unable to control.Please read this book. It will give you sight into this ongoing tragedy between men and women. Withhold your judgment until the end, if you have the wisdom to do so",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 14
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "this book ripped me apart but made me yearn for love at the same time",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3VF1JYY5ESIQQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 26, 2022",
  "reviewDescription": "so this was my first book that ive read in probably 4 years. i only listen to harry potter at night to fall asleep lol so this was the first real adult book ive really ever read. at first i didnt like it because the first chapter seemed to drag on forever. i felt like i wasnt getting any insight into the characters and the whole plot was just kinda boring until about 1/4 of the way into the book. and then i was hooked. i finished this book in 3 days. i cried so many times because of how beautiful it was, especially lily's love with atlas. but i also cried because of how horrible it was, the abuse with ryle but also with lily's parents. it was just such a beautiful, sad book. i know a lot of people didnt like the journal entries where lily was writing about atlas but i LOVED THEM. the plotline with atlas was my favorite part of the book i LOVE him. his and lily's relationship was so sweet. i cant wait to read more about them in it starts with us. overall a very good read that will have you smiling and then sobbing within minutes. RECOMMEND!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 15
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "The Start to my Coho Obsession",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1BOSZ28SJ60U1/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "This book was something that I believe is the epitome of powerful woman doing what’s better for them and learning from others mistakes. Lily’s character was something I felt was someone I can relate to because I have seen how domestic violence can ruin a person and how hard it is to walk away from that person. It takes a lot of courage to do that, and the way this book’s plot developed was from a girl ready to accept the fate of the beaten house wife , but then she knew this isn’t what she was in Boston for . She wanted better than the future her mother already lived . In my heart of hearts , if you want a book that will keep you on the edge of your seat with the play on words but also can rip ur heart out and cry . then this is the book for you !!!!! plz read <3",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 16
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "If you don’t already have this… WHY NOT?!?!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2ML621WX04W8Z/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 25, 2022",
  "reviewDescription": "I am an avid ready. Lately I haven’t been reading as much as I once did due to working, raising kiddos, and taking care of the daily household things and when I did find the time to read, I usually entertained the education/self help books. I saw a co-worker reading this a few weeks ago at work and she couldn’t say enough positive things about it. I was a Twilight enthusiast back in middle school and have fond memories of reading that series and escaping from my real-life problems. I decided that life is too serious to use what little leisurely time I had available for reading on just education/self help and the take a dive back to the genre that captivated me back then. And Man. BEST. DECISION. Seriously, if you are on the fence for any reason, hope OFF and read this. Honestly, read all of Colleen Hoover’s books.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 17
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Wow",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RZ1QN1AXBDY2X/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "4 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2022",
  "reviewDescription": "I just want to start off by saying that I am 26 years old and I’ve never picked up a book in my life. I always swore I hated reading. After all my clients and co workers were telling me to read this book I said ok it’s worth a shot. Since the day I picked up this book I haven’t been able to put it down. I think about reading it all day at work. I read it on my lunch break and any chance that I get. Today I have finished the book and I decided to leave a review because I give credit when credit is due.. this book was AMAZING! I laughed I cried I felt every emotions I never knew a book could make me feel. In my 26 years I’ve finally read a whole book and I am so happy. I already pre ordered part 2 to this book and followed the author on IG lol. Thank you Colleen Hoover for being a bad ass author!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 18
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Not just another romance novel. This book will rip your heart out.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1Z8PBBD7G8UXI/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "6 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "She makes you fall in love with him, then rips your heart out and makes you wish it didn’t end that way. Amazing writing. I started out thinking it was just another romance novel, but I was COMPLETELY WRONG! This book makes you feel so many things, and makes you scream in your head at what you hope the outcome will be. I love that she helps show the women’s side of abuse to help people understand what goes through their mind and why they can’t just leave.My three favorite lines:“People spend so much time wondering why the women don’t leave. Where are all the people who wonder why the men are even abusive? Isn’t that where the only blame should be place?” 🙌 Yaaaas“Sometimes the things that matter to you most are also the things that hurt you the most. And in order to get over that hurt, you have to sever all the extensions that keep you tethered to that pain.”“We break the pattern before the pattern breaks us.”",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 19
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "especially wearing his adorable scrubs, is easy on the eyes and such ...",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2RVOWHQ5OY9CZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2016",
  "reviewDescription": "THE STORY:Lisa: I went into this story completely blind. I do this quite a bit, honestly, and it almost always pays off. But with this book especially, I think going in blind is the way to go. If that’s not your reading style, I’ll give you just a bit of background.Lily hasn’t lived the easiest life. After graduating from college she moved to Boston where she opened her own business. Things were finally looking up for her. All of her hard work had paid off. She runs into a local neurosurgeon and immediately feels a connection with him. Ryle, especially wearing his adorable scrubs, is easy on the eyes and such a charmer. He’s also a player and only wants one-night-stands. He refuses to get into a relationship for several reasons, one of them being he just doesn’t have the time outside of being a doctor to be in a real relationship. The sparks start flying and Lily realizes she’s quite interested in Ryle… that is, until a blast from her past, Atlas, reappears, and brings up allllll kinds of confusing feelings.Becca: Yes! I 100% agree with Lisa, if you can go into this one blind then I recommend that you do! It was absolutely incredible to experience each moment and have no idea what was going to happen next!I don’t want to say too much and spoil the story for anyone. I will say that this book does span a large part of Lily’s life. We see her as a teen and also as an adult, it was very well done and I enjoyed the blend of past and present.THE CHARACTERS:Becca: Oh these characters… where do I begin?! I absolutely loved Lily! She had been through so much in her life, yet she persevered and followed her dreams. She was strong and fought for what she believed in. I loved learning about her past and being with her in the present. I felt as though I knew her, I understood and empathized with very thought and every emotion.When Lily met Ryle, I fell for him as instantaneously as she did. He was strong, confident, funny and of course sexy in scrubs ;) Their relationship was a whirlwind that wrapped them up so quickly and I was in it with them! When things got tough for them, I felt every moment as harshly as they did.When Atlas (the blast from Lily’s past) appears it throws this whole story in a different direction. Of course, we meet him with young Lily and then again later in the book. Atlas has this smooth, quiet confidence about him. He comes from absolutely nothing and makes something out of himself. I admired and respected him and I fell for him big time!I know some of you are probably sniffing out a love triangle and freaking out. In my opinion, that is NOT what this is. Some may call it a love triangle on a technical basis, but it really is not and I urge you not to skip this one for that reason because that term is to cliched for what this book actually is.Also the secondary characters in this book, Lily’s parents and Ryle’s sister and her husband are truly imperative in this story. They are just perfect and add so much to the story.I do not think that there is another Author out there who can make me fall in love with characters quite so hard. CoHo develops her characters so well that I feel as though I know them! I had so many feels for these characters that my heart couldn’t handle it! In the past I have loved many CoHo characters (and I still do) but none made me feel what these characters did and none made me feel quite so much that I was a part of their story. Trust me when I say these are characters that you want to meet.Lisa: That’s so, so true, Becca! I agree that CoHo has an amazing ability to make us fall in love with ALL characters, even the not-so-easy-to-love ones.I’m honestly not sure I would categorize this as a love triangle. I know others have, but I disagree. (view spoiler)My favorite characters in this story were, as Becca mentioned, the secondary characters. Specifically Ryle’s sister and her husband, who are wonderful additions to this beautiful story. I also enjoyed the family dynamics and how everyone had each others’ backs when it was most important.TO SUM UP:Lisa: WOW! Just… wow! This has got to be the BEST book Colleen Hoover has written to date. The stark honesty and impacting nature of this story will punch you in the feels. Hard. I’ve never experienced an abuse story to quite this level. I was blown away by this story and left a babbling ball of nerves and tears. A book hasn’t touched me this deeply in quite some time. I also learned quite a bit from this story. We’re always so quick to judge in instances of abuse… but there’s so much more to the story than you see with the naked eye. Don’t judge. Don’t assume facts that aren’t true. And, most importantly, don’t ever think it can’t happen to you or someone you know. Such a strong story that is sure to impact every reader that opens the cover in one way or another. I’m leave completely blown away by this story, as well as hopeful, which is such a wonderful thing. Colleen, you’ve done it AGAIN!Becca: I know some of you may think that I always say this and yes I am a true CoHo fan, but this is by far her best work ever. It Ends With Us is so raw and full of emotions, but most of all it is honest. I cried… A LOT! And I am not talking a few tears or a quiet wimper… I am talking ugly crying that I couldn’t contain. The message it delivers is a powerful one and I know that this is a book that will stay with me forever. Please make sure that once you are done you read the Author note at the end, it will give you an even better view of this book afterward.Colleen Hoover, you slay me with your words. You break my heart and then put the pieces back together. You are an amazing writer and I believe you are a gift for readers like myself. Keep doing what you are doing and I will keep reading everything that you write.(Thanks to Atria Books for the review copy!)",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 20
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Spectacular Story!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R22URCLNV637GY/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 9, 2022",
  "reviewDescription": "Wow! Couldn't put this down! Finished it in 2 days! The story touched me tremendously, having been in such a relationship myself when I was younger  & having lost a cousin to domestic violence as well. The book showed an aspect of love within a DV relationship that is, unfortunately, the reality for too many women. But the way the author depicted it, was similar to how my relationship began (and ended), and how I imagine so many others do as well. Looking forward to the next book to see what happens with Atlas.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 41
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Literally one of the best books I’ve ever read",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2YKMDF072RNYW/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 15, 2022",
  "reviewDescription": "I don’t even know how to put into just how much I loved this book into words. I’ve heard so many great things about the author of the book so I decided to read this novel first. As soon as I started reading it, I could not put it down. This book is completely different than what I thought it would be and if I’m being honest, I’m so glad that it was. If you’re thinking about buying and reading this book, DO IT!! You will not regret it.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 42
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I’m Still Reeling",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1TUP4O9T0YAVN/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 21, 2022",
  "reviewDescription": "This book was nothing I had anticipated. Being only the second book of Colleen’s that I have read I’m dying to read more. I can’t bring myself to pick up another one quite yet after finishing “It Ends With Us” because That book left me feeling some kind of way. It was intoxicating, exhilarating, and disappointing in the best and worst way. Such a good read! Colleen really knows how to write a good book.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 43
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Great Story Line",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RSU03KRC3N6KJ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 27, 2022",
  "reviewDescription": "I loved this book. It was well written you actually imagibe yourself in the book. The story was great and I believed it could be a relatable story for some of us. I did not believe it glorified DV like some reviews I read. It gave me a better understanding of what victims go through and what their thought process is. Again great book and I can't wait to read the second book!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 44
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Fantastic read",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3IQYJFGV0KC58/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "Reading tends to actually put me to sleep sadly. I managed to finish this book in just a few days. Kept your interest and I could not wait to get home to read! Such an amazing storyline on a topic that sadly is very true for way to many people. Struck close to home! Would highly recommend! Will be be buying more of this authors books. Can not wait to read the sequel.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 45
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "What happens if we repeatedly cover our mistakes with excuses?",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R21BR69Z3VFVH/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on June 13, 2022",
  "reviewDescription": "To cope with her feelings of anger toward her parents & their abusive marriage, Lily writes in her journal - to her idol, Ellen DeGeneres. Although Ellen will never see her “letters\", Lily finds comfort in “talking” to someone that she believes would understand. In this way Lily comforts herself as she trys to understand her confusing life. When Lily meets a boy, Atlas, who is living alone in the abandoned house behind her own home they become close friends and, eventually, Lily’s first crush. He dreams of going to Boston and when his uncle agrees to take him in that is where he moves.Fast forward and Lily is a college graduate, living in Boston, where she has realized her dream of opening her own flower shop. She meets Ryle, a highly ambitious neurosurgeon who is only into one night stands.When he falls for Lily they opt for a monogamous relationship. But Ryle has a temper that eventually shows itself in the ugliest of ways. Knowing of Ryle’s traumatic childhood, Lily wonders if she should accept his apology or if she’s making excuses for him as her mother had done for her father. \"Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.”A good story with an important message. “All humans make mistakes. What determines a person's character aren't the mistakes we make. It's how we take those mistakes and turn them into lessons rather than excuses.”  ⭐️⭐️⭐️⭐️",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 46
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "good and frustrating…..",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3T3UGXX607C72/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "As a survivor I appreciate the holistic complexities the author illustrates and articulates through her writing however, it felt a little rushed toward the end. She does a wonderful job developing the characters and I became a vested in the storyline. I still have so many questions and honestly the part that bothers me the most (hence 4 stars) is there was no further exploration of healing. Leaving doesn’t solve the mental and emotional trauma a survivor lives with. For fear of spoiling the entire story, I’ll stop here. I just wanted a little more emotionally and the responses of the people closest to the character sometimes felt unrealistic.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 47
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "It was so good!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3TSDVMO9P0EZ7/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 19, 2022",
  "reviewDescription": "This book was so hard to put down, it had a slow start and I wasn’t sure at first but then I got really into it and read it in 2 days. It made me feel so much, and if you’ve ever been in any type of toxic relationship it was relatable to that. The epilogue at the end made me so ready for October to come when the second book is released!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 48
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Wow!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1C9W65K0U7XDM/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "I just loved this book.  There was a lot of hype about the book so I was expecting disappointment.  It did not disappoint.  There was a sufficient amount of complexity to the characters and great romance.  The serious elements of the book were so believable and authentic.  Very fast read.  great for the beach or a quiet Saturday/weekend.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 49
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Must read!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R36ETMG6VK3FHS/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "This is the first novel I've read by Colleen Hoover. I didn't know what to expect going into it, but this book took me on a beautiful, heartbreaking, ugly, real, emotional ride. Without spoiling, it can be triggering to some. Please make sure to take a moment if it becomes too much for you. All that said, I'm anxiously awaiting the release of the sequel in October",
  "isVerified": true,
  "variant": "",
  "reviewImages": [],
  "position": 50
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Finally read it after months on KU Romances",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1EHKL0BNG56YR/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "9 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2022",
  "reviewDescription": "So much hype over this book! I've read dozens and dozens of KU Romances across every genre - billionaire, mafia, same sex, enemies to lovers, second chance, dark, light, everything in between. There is some really good content over there so I finally wanted to see how they compared to one of the best selling romance novels of all time. Selfishly I also wanted to see how Hoover's writing (this is my first of hers i've read) compared to Sylvia Day whose Bared series I loved Books 1-3.Overall I give this a 4 stars. It didn't completely bowl me over but overall really good. One little admission is that I totally skipped the pages and pages and pages of \"journal entries\" aka back story for Lily and Atlas, and guess what? Still was able to figure out the story just fine :) It came across to me as filler and really slowed the plot down but I know some readers love those juicy details. I just wanted to get back to the main story line and honestly some of the entries were like 12 pages long. If you wanna do the same, I won't tell anybody and I promise you won't be lost.Spoilers ahead.This book honestly wasn't as dark as I thought it would be given all the talk of domestic violence. I thought it would be scene after scene, but there were only 3 incidents in the whole book, 2 of which were somewhat unintentional and/or partially happenstance, while the third was just nauseatingly purposeful. Some of the MC (Lily) reactions seemed a little fake or contrived, and especially I DID not like it when she informed Ryle WHILE HE HELD HIS NEWBORN BABY that she wanted a divorce. Surely she could have waited a day? I don't like when books make me dislike a protagonist and up until this very point at the end, I had really liked Lily.Ryle and his thought processes were right on. Having experience with men with major emotional trauma this really hit home for me and seemed incredibly realistic. There are two types of abusers in my opinion - the ones who are truly mean and don't care that they are hurting others and the the ones with the demons they can't control. Him putting on Lily by saying \"help me\" as though its up to her to heal him was really on point (if very, very wrong - he is responsible for his own healing).Anyway, overall pretty well done if a little too much filler in the middle of the book. The ending was pretty superb and that Epilogue! I have to admit I was rooting for Atlas the whole time, but I have a weak spot for rescuers. Unfortunately I didn't really get invested in any of the characters enough to want to spend the money or time on It Starts with Us, which starts where EWU leaves off. I think I'll move on to Ugly Love which I heard was steamier and is a little more along my preference lines.TBH if you are looking for pure drama and emotional angst Sylvia Day's Book 1 of Bared series is going to leave you gasping, its way more fast paced. Unfortunately though the series drops off in quality after book 3, and one thing CoHo fans love is her consistency.HTH!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 31
},
{
  "productAsin": "1501110365",
  "ratingScore": 4,
  "reviewTitle": "Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1DC45AZ5WS3PZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "20 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2016",
  "reviewDescription": "*Review originally posted on Goodreads*'I wish cutting my feelings off for the person who hurt me was as easy as I used to think it would be. Preventing your heart from forgiving someone you love is actually a hell of a lot harder than simply forgiving them.'It Ends With Us was beautifully complicated. It was hot and cold. Up and down. Good and bad. Beautiful and ugly... I'm still trying to figure out how I really feel about it all because I'm genuinely torn on how I want to perceive this storyline. I loved it but in all honesty, I really do think I hate it as well. Not the \"I-hate-you-Colleen-Hoover-stop-writing-books-and-find-a-different-career\" type of hate but rather \"I-hate-you-Colleen-Hoover-for-making-me-hate-everything-that-I-came-to-love\" kind of hate because it pretty much summarizes all my thoughts and feelings about It Ends With Us in one sentence.My opinions were completely divided. One side of me, the hopeless romantic, was utterly unsatisfied and angry with the outcome of the story. The opposite side, the one that's all about women's empowerment, was cheering on #TeamLily like it was Independence Day.Rather than trying to sugarcoat my thoughts, I'm just going to be completely honest. I was 100 percent team Ryle from the very first time we met him. Just like Lily, I fell in love with every word and every gesture that rolled off of his body. I. WAS. HOOKED. It also didn't help that I kept fantasizing Doctor Mike as Ryle Kincaid. *heart eyes emoji* I loved his ambition. His personality. His confidence. To be honest, I think I might've loved Ryle even more than Lily did but that's another story for another day. That more than likely explains why I took the second half of this book like a blow to the gut.Once we got to the second half of the book, that's where it started going a bit downhill for me as a Ryle and Lily shipper. Every happy moment that ever happened between my ship came barreling down as it collided with pain and abuse. I was angry. I was thrashing. I was yelling at the pages in front of me, \"Why are you doing this Colleen?!\" But most importantly, I was just heartbroken to see such a beautiful couple become so toxic. Everything I loved about the first half of the book was slowly unraveling right before my very eyes as if it never really existed in the first place. I can't even remember how many times I wanted to put the book down because my hopeless romantic self just couldn't handle it anymore. But I just kept on reading because I was guiltily hoping that Ryle and Lily would still have their happy ending despite all that had happened. :/ Sadly, this was where I was torn the most.I have the upmost respect for Lily. She is definitely one of my favorite female characters that Colleen has ever created because she did what a lot of us would've struggled to do in the end: walk away. Lily was such a strong character and I admire her so much for having the strength to stand up for herself. There were numerous times towards the end of the book where I knew I probably would've gave in and forgave Ryle for his actions but Lily was inflexible. She was in a tough position but she put her foot down and demanded better for herself. In the end, no matter if I ship Ryle/Lily or Atlas/Lily, I'm glad that Lily was able to find peace for her and Emmy.As for Atlas, I liked him but I didn't love him. Definitely nowhere near my love for Ryle. I wasn't exactly rooting for Atlas but I wouldn't have minded if Lily chose him in the end. However, I still very much preferred Ryle regardless. I just felt that Atlas was the typical knight in shining armor. Typical good guy you run to. His background story was interesting but him as a character... not so much. He just felt so ordinary and predictable. I wanted to ship Atlas and Lily because let's face it, the signs were practically being shoved down our throats, and although the relationship between Ryle and Lily was developing, Atlas's presence was a like a thorn on your side you just couldn't shake off. But I just couldn't bring myself to ship them blindly like I did with Ryle and Lily.Unfortunately, I was too far gone and too far in love with the idea of Ryle and Lily to make room for Atlas and because of that, I'm not sure if I'll ever be fully satisfied with that ending. I was happy that Lily was no longer a victim of domestic abuse. I'm glad that after all that happened between them, Lily and Ryle parted on good terms. I'll forever be heartbroken over the idea of what could've been. And I feel indifferent to Lily and Atlas. Sorry not sorry, Atlas. That basically sums up all my feelings in a nutshell.To be honest, I was actually feeling a bit more bitter than I'm making it seem after that ending. But after reading the author's note, it really put things in perspective for me and made me look at the story with brand new eyes. I developed a new understanding and appreciation for the story behind the story.I was dying for Ryle and Lily to have their happy ending. Until the very end, I was still rooting for them. It's such an ugly confession to make especially when the couple you're rooting for is toxic and abusive. And I think I feel this way because I never, and hopefully I never will, had to experience abuse. I don't know what it's like and what goes on in the minds of the abused. Colleen did such an excellent job at creating the perfectly imperfect man that was Ryle. Abuse in books has always been a trigger for me and if it were any other book I think I would've put this book down by the first incident of abuse. But Colleen just made you fall so deeply in love with a character that even you couldn't bring yourself to hate him even if you wanted to. YOU were the Lily of this story. But unfortunately, I don't think my Lily would've had the courage to leave. I really wish I could say that I would leave in an instant, but I think I would honestly be lying to myself. You can tell yourself that if you were in Lily's position you would leave in a blink of an eye, but things wouldn't be as easily said and done if you were the one who was actually experiencing it all. And in truth, I think this is exactly what Colleen wanted us to actually sit down and think about because victims who've experienced abuse wouldn't be rooting for Ryle and Lily. I wouldn't be rooting for Ryle and Lily. It just goes to show how much of a struggle it really is to walk away from someone you love and loves you back in all the wrong ways. I usually never read the author's notes after the book but I'm really glad I took the time to read Colleen's story. It really did make me see the situation from a different perspective.I'd been having a bad CoHo streak for three books in a row (if you're curious, the books were — in order — Hopeless, November 9, and Too Late) and for a moment there I was beginning to think that I was doomed to never enjoy another book written by Colleen Hoover again. But PRAISE. It Ends With Us restored my faith completely in the CoHo hype. Not that I was ever planning NOT to read any more of Colleen's books! Colleen Hoover is 100 percent my favorite auto-buy author. I will always buy her books no matter if I end up loving them or not, and with good reason because Colleen is such an exceptional writer. It Ends With Us still wasn't able to top Ugly Love as my favorite CoHo book of all time but I really enjoyed this book more than I thought I would.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 32
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "I COULD NOT PUT THIS BOOK DOWN.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1SYA6SUVHNITL/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "29 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 11, 2022",
  "reviewDescription": "This book.... OHHH my gosh. This book was so heart-wrenching, yet so beautiful at the same time. Coming from someone who has experienced domestic violence in the past it really hits home. When I first bought this book I didn't know what to except, but it wasn't this. It was everything I could've hoped for and MORE. I loved the way she portrayed Lily. She was so courageous, bold, relatable and perfect in all the right ways. I cannot wait for book 2!!! Once I finished, I couldn't stop crying for a whole hour straight. I can't even remember turning pages because it had me hooked that good!! READ IT READ IT READ IT!*SPOILERS*]First off, some of these reviews piss me off, especially the ones that are geared toward the main character Lily.\"Why did Colleen have her stay with someone who was constantly abusing her and treating her as so\"?\"I was so pissed she got right with Atlas right after the whole thing with Ryle happened, that would not happen in real life...\"First off, if you have ever experienced domestic violence in your life you would know how hard it is to leave the situation. Second, did you even read the book? Lily clearly states her confusion with either staying or leaving. It's not like she was staying with him because she liked the abuse?! Some of yawl's reviews seriously get to me. Imagine falling in love with someone who was absolutely perfect in your eyes and treated you in all the ways you'd ever imagine. You then get tied down... He starts to abuse you... Does things to you that you never thought this man who loved you SO much could possibly do?!? But it happens. It's not that easy to up in leave... If you TRULY knew what it is like to experience domestic abuse you would know that. So please stop getting mad at Lily for taking so long to leave! The whole thing about her getting with Atlas so fast after the whole dealio with Ryle ended, was PERFECT in my eyes. People are getting mad at how quickly she got back with him, but he was her safe place and FIRST true love (who matter-of-fact she never fell out of love with). I would've done the exact same dang thing!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 33
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Every woman should read this book",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1ASM5ROQC4Z16/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "32 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 17, 2022",
  "reviewDescription": "I have never been inspired to write a book review. This is my first. I read all the critical reviews, but the subject matter of this book hit a very sensitive nerve for me. First of all, for those who thought the book was too sensual or too emotional, I must venture a guess this subject matter is something they have never lived or even thought was possible.Domestic abuse has many sides and many questions. If you have not been a victim, it might be easy to say,”Why didn’t you leave?” This book answers many questions and explores the victims and abusers viewpoints. The most prominent quotation in this book for me is, “There are no bad people, only people who do bad things.” I believe the circumstances of our childhoods shape us into the adults we become, even more than genetics. The traumas we have to survive and the way we are made to feel about ourselves stay with us.I was a survivor of my parents abuse of each other. It was not just my father, but also my mother who fought violently with each other. I was able to go to university and leave the trauma physically, but not emotionally.I married the first man who proposed so I didn’t have to go home.I withstood his verbal and physical abuse for 28 years. He stopped hurting me before my bruises and choking so as not to send me to the hospital. I stayed with him for 28 years because he was a good father and my daughters loved him.I loved him because when he was good, he was very good. Was I stupid? Was I afraid to go out on my own? Yes. My children came first. I would endure anything for their safety and happiness.This amazing book addresses both sides of abuse, from each perspective. The heartbreak of having to decide your future with a man you love with all your heart, who loves you with everything he has in him, but who also has demons he is unable to control.Please read this book. It will give you sight into this ongoing tragedy between men and women. Withhold your judgment until the end, if you have the wisdom to do so",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 34
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "this book ripped me apart but made me yearn for love at the same time",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3VF1JYY5ESIQQ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 26, 2022",
  "reviewDescription": "so this was my first book that ive read in probably 4 years. i only listen to harry potter at night to fall asleep lol so this was the first real adult book ive really ever read. at first i didnt like it because the first chapter seemed to drag on forever. i felt like i wasnt getting any insight into the characters and the whole plot was just kinda boring until about 1/4 of the way into the book. and then i was hooked. i finished this book in 3 days. i cried so many times because of how beautiful it was, especially lily's love with atlas. but i also cried because of how horrible it was, the abuse with ryle but also with lily's parents. it was just such a beautiful, sad book. i know a lot of people didnt like the journal entries where lily was writing about atlas but i LOVED THEM. the plotline with atlas was my favorite part of the book i LOVE him. his and lily's relationship was so sweet. i cant wait to read more about them in it starts with us. overall a very good read that will have you smiling and then sobbing within minutes. RECOMMEND!!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 35
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "The Start to my Coho Obsession",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1BOSZ28SJ60U1/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "One person found this helpful",
  "reviewedIn": "Reviewed in the United States on August 23, 2022",
  "reviewDescription": "This book was something that I believe is the epitome of powerful woman doing what’s better for them and learning from others mistakes. Lily’s character was something I felt was someone I can relate to because I have seen how domestic violence can ruin a person and how hard it is to walk away from that person. It takes a lot of courage to do that, and the way this book’s plot developed was from a girl ready to accept the fate of the beaten house wife , but then she knew this isn’t what she was in Boston for . She wanted better than the future her mother already lived . In my heart of hearts , if you want a book that will keep you on the edge of your seat with the play on words but also can rip ur heart out and cry . then this is the book for you !!!!! plz read <3",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 36
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "If you don’t already have this… WHY NOT?!?!",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2ML621WX04W8Z/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 25, 2022",
  "reviewDescription": "I am an avid ready. Lately I haven’t been reading as much as I once did due to working, raising kiddos, and taking care of the daily household things and when I did find the time to read, I usually entertained the education/self help books. I saw a co-worker reading this a few weeks ago at work and she couldn’t say enough positive things about it. I was a Twilight enthusiast back in middle school and have fond memories of reading that series and escaping from my real-life problems. I decided that life is too serious to use what little leisurely time I had available for reading on just education/self help and the take a dive back to the genre that captivated me back then. And Man. BEST. DECISION. Seriously, if you are on the fence for any reason, hope OFF and read this. Honestly, read all of Colleen Hoover’s books.",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 37
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Wow",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RZ1QN1AXBDY2X/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "4 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 24, 2022",
  "reviewDescription": "I just want to start off by saying that I am 26 years old and I’ve never picked up a book in my life. I always swore I hated reading. After all my clients and co workers were telling me to read this book I said ok it’s worth a shot. Since the day I picked up this book I haven’t been able to put it down. I think about reading it all day at work. I read it on my lunch break and any chance that I get. Today I have finished the book and I decided to leave a review because I give credit when credit is due.. this book was AMAZING! I laughed I cried I felt every emotions I never knew a book could make me feel. In my 26 years I’ve finally read a whole book and I am so happy. I already pre ordered part 2 to this book and followed the author on IG lol. Thank you Colleen Hoover for being a bad ass author!",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 38
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "Not just another romance novel. This book will rip your heart out.",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1Z8PBBD7G8UXI/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "6 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 20, 2022",
  "reviewDescription": "She makes you fall in love with him, then rips your heart out and makes you wish it didn’t end that way. Amazing writing. I started out thinking it was just another romance novel, but I was COMPLETELY WRONG! This book makes you feel so many things, and makes you scream in your head at what you hope the outcome will be. I love that she helps show the women’s side of abuse to help people understand what goes through their mind and why they can’t just leave.My three favorite lines:“People spend so much time wondering why the women don’t leave. Where are all the people who wonder why the men are even abusive? Isn’t that where the only blame should be place?” 🙌 Yaaaas“Sometimes the things that matter to you most are also the things that hurt you the most. And in order to get over that hurt, you have to sever all the extensions that keep you tethered to that pain.”“We break the pattern before the pattern breaks us.”",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 39
},
{
  "productAsin": "1501110365",
  "ratingScore": 5,
  "reviewTitle": "especially wearing his adorable scrubs, is easy on the eyes and such ...",
  "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2RVOWHQ5OY9CZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=1501110365",
  "reviewReaction": "2 people found this helpful",
  "reviewedIn": "Reviewed in the United States on August 22, 2016",
  "reviewDescription": "THE STORY:Lisa: I went into this story completely blind. I do this quite a bit, honestly, and it almost always pays off. But with this book especially, I think going in blind is the way to go. If that’s not your reading style, I’ll give you just a bit of background.Lily hasn’t lived the easiest life. After graduating from college she moved to Boston where she opened her own business. Things were finally looking up for her. All of her hard work had paid off. She runs into a local neurosurgeon and immediately feels a connection with him. Ryle, especially wearing his adorable scrubs, is easy on the eyes and such a charmer. He’s also a player and only wants one-night-stands. He refuses to get into a relationship for several reasons, one of them being he just doesn’t have the time outside of being a doctor to be in a real relationship. The sparks start flying and Lily realizes she’s quite interested in Ryle… that is, until a blast from her past, Atlas, reappears, and brings up allllll kinds of confusing feelings.Becca: Yes! I 100% agree with Lisa, if you can go into this one blind then I recommend that you do! It was absolutely incredible to experience each moment and have no idea what was going to happen next!I don’t want to say too much and spoil the story for anyone. I will say that this book does span a large part of Lily’s life. We see her as a teen and also as an adult, it was very well done and I enjoyed the blend of past and present.THE CHARACTERS:Becca: Oh these characters… where do I begin?! I absolutely loved Lily! She had been through so much in her life, yet she persevered and followed her dreams. She was strong and fought for what she believed in. I loved learning about her past and being with her in the present. I felt as though I knew her, I understood and empathized with very thought and every emotion.When Lily met Ryle, I fell for him as instantaneously as she did. He was strong, confident, funny and of course sexy in scrubs ;) Their relationship was a whirlwind that wrapped them up so quickly and I was in it with them! When things got tough for them, I felt every moment as harshly as they did.When Atlas (the blast from Lily’s past) appears it throws this whole story in a different direction. Of course, we meet him with young Lily and then again later in the book. Atlas has this smooth, quiet confidence about him. He comes from absolutely nothing and makes something out of himself. I admired and respected him and I fell for him big time!I know some of you are probably sniffing out a love triangle and freaking out. In my opinion, that is NOT what this is. Some may call it a love triangle on a technical basis, but it really is not and I urge you not to skip this one for that reason because that term is to cliched for what this book actually is.Also the secondary characters in this book, Lily’s parents and Ryle’s sister and her husband are truly imperative in this story. They are just perfect and add so much to the story.I do not think that there is another Author out there who can make me fall in love with characters quite so hard. CoHo develops her characters so well that I feel as though I know them! I had so many feels for these characters that my heart couldn’t handle it! In the past I have loved many CoHo characters (and I still do) but none made me feel what these characters did and none made me feel quite so much that I was a part of their story. Trust me when I say these are characters that you want to meet.Lisa: That’s so, so true, Becca! I agree that CoHo has an amazing ability to make us fall in love with ALL characters, even the not-so-easy-to-love ones.I’m honestly not sure I would categorize this as a love triangle. I know others have, but I disagree. (view spoiler)My favorite characters in this story were, as Becca mentioned, the secondary characters. Specifically Ryle’s sister and her husband, who are wonderful additions to this beautiful story. I also enjoyed the family dynamics and how everyone had each others’ backs when it was most important.TO SUM UP:Lisa: WOW! Just… wow! This has got to be the BEST book Colleen Hoover has written to date. The stark honesty and impacting nature of this story will punch you in the feels. Hard. I’ve never experienced an abuse story to quite this level. I was blown away by this story and left a babbling ball of nerves and tears. A book hasn’t touched me this deeply in quite some time. I also learned quite a bit from this story. We’re always so quick to judge in instances of abuse… but there’s so much more to the story than you see with the naked eye. Don’t judge. Don’t assume facts that aren’t true. And, most importantly, don’t ever think it can’t happen to you or someone you know. Such a strong story that is sure to impact every reader that opens the cover in one way or another. I’m leave completely blown away by this story, as well as hopeful, which is such a wonderful thing. Colleen, you’ve done it AGAIN!Becca: I know some of you may think that I always say this and yes I am a true CoHo fan, but this is by far her best work ever. It Ends With Us is so raw and full of emotions, but most of all it is honest. I cried… A LOT! And I am not talking a few tears or a quiet wimper… I am talking ugly crying that I couldn’t contain. The message it delivers is a powerful one and I know that this is a book that will stay with me forever. Please make sure that once you are done you read the Author note at the end, it will give you an even better view of this book afterward.Colleen Hoover, you slay me with your words. You break my heart and then put the pieces back together. You are an amazing writer and I believe you are a gift for readers like myself. Keep doing what you are doing and I will keep reading everything that you write.(Thanks to Atria Books for the review copy!)",
  "isVerified": true,
  "variant": "",
  "reviewImages": [
    "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/71Sfu26+EaL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81+AgEVB0AL._SY88.jpg",
    "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71z4r-4VgXL._SY88.jpg"
  ],
  "position": 40
}]